[{"titles":"Curiosities of the Sky","authors":"(Pseudonym)","id":5626416,"avg_rating":3.17,"tot_rating":35,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328306364l\/5626416.jpg","description":"Curiosities of the Sky is a newly annotated edition of the 1909 popular astronomy classic. All of the original text, photographs and diagrams are preserved, and new text added providing updates in the progress of astronomy since the book was first published. Garrett Serviss wrote with a firm understanding of the science of the period. He was also graced with a delightful imagination and unequaled power of poetic expression in describing the wonders and mysteries of the universe. A few of the topics covered: * The strange unfixedness of the `fixed stars.' * The slow passing of the constellations. * The assembly of stars in immense clouds, swarms, and clusters. * The starless gaps in the Milky Way. * The marvelous phenomena of new, or temporary, stars. * The amazing forms of the whirlpool, spiral, pinwheel, and lace, or tress, nebulae. * The strange surroundings of the Sun. * The mystery of the Zodiacal Light and the Gegenschein. * The extraordinary transformations of comets and their tails. * The prodigies of meteorites and masses of stone and metal fallen from the sky. * The cataclysms that have wrecked the moon. * The problem of life and intelligence on Mars. * The problematical origin and fate of the asteroids. * The strange phenomena of the auroral lights.","genre":"Science, Science, Astronomy","format":null,"page":null,"isbn":null,"au_ge":"(pseudonym) science science astronomy","key_words":"moon gegenschein fixed stars mystery cataclysms prodigies intelligence auroral lights masses zodiacal light astronomy since describing meteorites slow passing new text added providing updates preserved constellations sun asteroids newly annotated edition metal fallen firm understanding wonders first published garrett serviss wrote comets whirlpool spiral pinwheel tails assembly book strange surroundings life stone progress also graced topics covered popular classic science clusters starless gaps marvelous phenomena amazing forms poetic expression temporary unfixedness extraordinary transformations problematical origin tress nebulae universe wrecked fate curiosities lace diagrams unequaled power problem delightful imagination mars immense clouds swarms mysteries sky original photographs period milky way","bow":"(pseudonym) science science astronomy moon gegenschein fixed stars mystery cataclysms prodigies intelligence auroral lights masses zodiacal light astronomy since describing meteorites slow passing new text added providing updates preserved constellations sun asteroids newly annotated edition metal fallen firm understanding wonders first published garrett serviss wrote comets whirlpool spiral pinwheel tails assembly book strange surroundings life stone progress also graced topics covered popular classic science clusters starless gaps marvelous phenomena amazing forms poetic expression temporary unfixedness extraordinary transformations problematical origin tress nebulae universe wrecked fate curiosities lace diagrams unequaled power problem delightful imagination mars immense clouds swarms mysteries sky original photographs period milky way"},{"titles":"Chivalry","authors":"Booth Tarkington","id":385809,"avg_rating":3.68,"tot_rating":40,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348436812l\/385809.jpg","description":"Inasmuch as it was by your command illustrious and exalted lady that I have gathered together these stories to form the present little book you should the less readily suppose I have presumed to dedicate to your Serenity this trivial offering because of my esteeming it to be not undeserving of your acce","genre":"Fantasy","format":"paperback","page":188.0,"isbn":9781426455995.0,"au_ge":"boothtarkington fantasy","key_words":"inasmuch present little book presumed exalted lady serenity undeserving form gathered together dedicate command illustrious less readily suppose esteeming acce stories trivial offering","bow":"boothtarkington fantasy inasmuch present little book presumed exalted lady serenity undeserving form gathered together dedicate command illustrious less readily suppose esteeming acce stories trivial offering"},{"titles":"The Island Pharisees","authors":"Garrett P. Serviss","id":1069228,"avg_rating":3.79,"tot_rating":61,"year_pub":"1909","img":null,"description":"A scathing satire on British upper-class hypocrisy by the author of The Forsyte Saga","genre":"Classics, Fiction, Literature, English Literature, Literary Fiction","format":"hardcover","page":null,"isbn":null,"au_ge":"garrettpserviss classics fiction literature englishliterature literaryfiction","key_words":"forsyte saga scathing satire british upper class hypocrisy author","bow":"garrettpserviss classics fiction literature englishliterature literaryfiction forsyte saga scathing satire british upper class hypocrisy author"},{"titles":"The Hidden Church of the Holy Graal","authors":"James Branch Cabell","id":2436684,"avg_rating":3.86,"tot_rating":29,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347718990l\/2436684.jpg","description":"It is at the core of all Western culture: the story of the Holy Grail, the secret history of Christianity and the grand quest to find it that informs everything from tales steeped in centuries, such as the legend of King Arthur, to the most modern popular fiction, like The Da Vinci Code. In this highly readable but densely informative work, Waite, a preeminent 19th-century expert in esoterica, explores all the literature dedicated to this \"legend of the soul\" from both an intellectual and a spiritual perspective, seeking out the elemental through-lines of this most fundamental of stories as well as a mystical essence of Christianity itself. Students of folklore, readers of fantasy-quest fiction, and seekers after religious truth will all find this a vital resource. American-born British occultist and author ARTHUR EDWARD WAITE (1857-1942) was cocreator of the famous 1910 Rider-Waite Tarot deck. Among his numerous books are Book of Ceremonial Magic, The Holy Kabbalah, and New Encyclopedia of Freemasonry.","genre":"Religion, Occult, Fantasy, Magic","format":"paperback","page":604.0,"isbn":9781602062375.0,"au_ge":"jamesbranchcabell religion occult fantasy magic","key_words":"literature dedicated tales steeped informs everything vital resource american born british occultist seekers author arthur edward waite densely informative work grand quest ceremonial magic holy grail fundamental western culture da vinci code famous rider tarot deck among well cocreator intellectual core christianity new encyclopedia king book secret history fantasy fiction soul legend elemental esoterica explores stories religious truth numerous books freemasonry lines story folklore readers modern popular like preeminent th century expert kabbalah spiritual perspective seeking students highly readable centuries mystical essence find","bow":"jamesbranchcabell religion occult fantasy magic literature dedicated tales steeped informs everything vital resource american born british occultist seekers author arthur edward waite densely informative work grand quest ceremonial magic holy grail fundamental western culture da vinci code famous rider tarot deck among well cocreator intellectual core christianity new encyclopedia king book secret history fantasy fiction soul legend elemental esoterica explores stories religious truth numerous books freemasonry lines story folklore readers modern popular like preeminent th century expert kabbalah spiritual perspective seeking students highly readable centuries mystical essence find"},{"titles":"The Ancient Greek Historians","authors":"John Galsworthy","id":860592,"avg_rating":3.83,"tot_rating":30,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347430494l\/860592.jpg","description":"This well known, easily read work covers the entire field of classical historians from the early writers to Herodotus, Thucydides, Xenophon, through Poseidonius and such Romans as Tacitus, Cato, Caesar, Livy. Scores of writers are studied biographically, in style, sources, accuracy, structure, historical concepts, and influences. Recent discoveries such as the Oxyrhinchus papyri are referrred to, as well as such great scholars as Nissen, Gomperz, Cornford, etc.","genre":"History, Classics","format":"paperback","page":292.0,"isbn":9781410200853.0,"au_ge":"johngalsworthy history classics","key_words":"classical historians romans tacitus cato caesar livy scores oxyrhinchus papyri well poseidonius entire field style sources accuracy structure historical concepts known easily read work covers great scholars studied biographically influences recent discoveries referrred early writers nissen gomperz cornford etc herodotus thucydides xenophon","bow":"johngalsworthy history classics classical historians romans tacitus cato caesar livy scores oxyrhinchus papyri well poseidonius entire field style sources accuracy structure historical concepts known easily read work covers great scholars studied biographically influences recent discoveries referrred early writers nissen gomperz cornford etc herodotus thucydides xenophon"},{"titles":"Tree of Knowledge","authors":"Arthur Edward Waite","id":5041959,"avg_rating":3.27,"tot_rating":37,"year_pub":"1909","img":null,"description":"Henry James' short story is a great beginning for readers interested in the Victorian author's work. Only eleven pages long, James weaves a story of a man in love with his best friend's wife, his devotion to the friend, and his resistance of having his true feelings known. This is a great peice to pick up as a starter into James' canon as his work can inundate readers with the floral prose of the era.","genre":"Fiction, Short Stories","format":"paperback","page":11.0,"isbn":null,"au_ge":"arthuredwardwaite fiction shortstories","key_words":"resistance henry james short story great beginning devotion work friend floral prose victorian authors love man pick eleven pages long weaves inundate readers best friends wife interested starter peice era canon true feelings known","bow":"arthuredwardwaite fiction shortstories resistance henry james short story great beginning devotion work friend floral prose victorian authors love man pick eleven pages long weaves inundate readers best friends wife interested starter peice era canon true feelings known"},{"titles":"Egoists, A Book Of Supermen: Stendhal, Baudelaire, Flaubert, Anatole France, Huysmans, Barrès, Nietzsche, Blake, Ibsen, Stirner, And Ernest Hello","authors":"John Bagnell Bury","id":781684,"avg_rating":4.37,"tot_rating":19,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1464117708l\/781684.jpg","description":"This scarce antiquarian book is included in our special Legacy Reprint Series. In the interest of creating a more extensive selection of rare historical book reprints, we have chosen to reproduce this title even though it may possibly have occasional imperfections such as missing and blurred pages, missing text, poor pictures, markings, dark backgrounds and other reproduction issues beyond our control. Because this work is culturally important, we have made it available as a part of our commitment to protecting, preserving and promoting the world's literature.","genre":"Philosophy, Writing, Essays","format":"hardcover","page":372.0,"isbn":9780404105259.0,"au_ge":"johnbagnellbury philosophy writing essays","key_words":"worlds literature blurred pages missing text poor pictures markings dark backgrounds title even though commitment may possibly interest work included part reproduction issues beyond creating scarce antiquarian book reproduce extensive selection control protecting preserving made chosen available occasional imperfections promoting special legacy reprint series rare historical reprints culturally important","bow":"johnbagnellbury philosophy writing essays worlds literature blurred pages missing text poor pictures markings dark backgrounds title even though commitment may possibly interest work included part reproduction issues beyond creating scarce antiquarian book reproduce extensive selection control protecting preserving made chosen available occasional imperfections promoting special legacy reprint series rare historical reprints culturally important"},{"titles":"Greek Thinkers: A History of Ancient Philosophy","authors":"Henry James","id":2903632,"avg_rating":4.11,"tot_rating":19,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348446961l\/2903632.jpg","description":"Many of the earliest books, particularly those dating back to the 1900s and before, are now extremely scarce and increasingly expensive. We are republishing these classic works in affordable, high quality, modern editions, using the original text and a","genre":"Philosophy, History","format":"paperback","page":620.0,"isbn":9781406766059.0,"au_ge":"henryjames philosophy history","key_words":"original text increasingly expensive republishing affordable high quality modern editions using classic works earliest books particularly many extremely scarce dating back","bow":"henryjames philosophy history original text increasingly expensive republishing affordable high quality modern editions using classic works earliest books particularly many extremely scarce dating back"},{"titles":"زن زیادی","authors":"James Huneker","id":6256895,"avg_rating":3.45,"tot_rating":31,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1573393441l\/6256895.jpg","description":"زن زیادی یا زن فروشی داستان زنی است که میان دو مرد خرید و فروش می‌شود. نام داستان گویای طنز است اما محتوای داستان به هیچ وجه طنز نیست و در اصل تراژیک است. گروهولسکی مردی عاشق پیشه اما ضعیف‌النفس که عاشق لیزا است تصمیم می‌گیرد او را از شوهرش جدا کرده و به ازدواج خود درآورد. بوگروف شوهر لیزا به راز آن‌ها پی می‌برد و لیزا را تهدید به کتک و شکایت می‌کند. اما از آنجایی که مرد پول‌پرستی است در مقابل پیشنهاد جذاب گروهولسکی در خصوص فروش لیزا به قیمتی بالا مقاومت نمی‌کند و در ازای دریافت مبلغ ۱۵۰ هزار پوند لیزا را به او می‌فروشد. لیزا به همراه گروهولسکی می‌رود اما فرزند چند ماهه‌اش را در خانه بوگروف جای می‌گذارد. مصائب لیزا از همین‌جا آغاز می‌شود. چخوف نه تنها سرشت مردان را خوب می‌شناسد بلکه با سرشت زنان نیز بیگانه نیست. سرنوشت لیزا سرنوشت زنانی است که در جامعه‌های اشرافی و متحجر به راحتی خرید و فروش می‌شوند و بر هستی فردی خود هیچگونه سیطره‌ای ندارند.","genre":"Literature","format":"paperback","page":96.0,"isbn":null,"au_ge":"jameshuneker literature","key_words":"زن زیادی یا فروشی داستان زنی است که میان دو مرد خرید و فروش می ‌ شود نام گویای طنز اما محتوای به هیچ وجه نیست در اصل تراژیک گروهولسکی مردی عاشق پیشه ضعیف النفس لیزا تصمیم گیرد او را از شوهرش جدا کرده ازدواج خود درآورد بوگروف شوهر راز آن ها پی برد تهدید کتک شکایت کند آنجایی پول پرستی مقابل پیشنهاد جذاب خصوص قیمتی بالا مقاومت نمی ازای دریافت مبلغ ۱۵۰ هزار پوند فروشد همراه رود فرزند چند ماهه اش خانه جای گذارد مصائب همین جا آغاز چخوف نه تنها سرشت مردان خوب شناسد بلکه با زنان نیز بیگانه سرنوشت زنانی جامعه های اشرافی متحجر راحتی شوند بر هستی فردی هیچگونه سیطره ای ندارند","bow":"jameshuneker literature زن زیادی یا فروشی داستان زنی است که میان دو مرد خرید و فروش می ‌ شود نام گویای طنز اما محتوای به هیچ وجه نیست در اصل تراژیک گروهولسکی مردی عاشق پیشه ضعیف النفس لیزا تصمیم گیرد او را از شوهرش جدا کرده ازدواج خود درآورد بوگروف شوهر راز آن ها پی برد تهدید کتک شکایت کند آنجایی پول پرستی مقابل پیشنهاد جذاب خصوص قیمتی بالا مقاومت نمی ازای دریافت مبلغ ۱۵۰ هزار پوند فروشد همراه رود فرزند چند ماهه اش خانه جای گذارد مصائب همین جا آغاز چخوف نه تنها سرشت مردان خوب شناسد بلکه با زنان نیز بیگانه سرنوشت زنانی جامعه های اشرافی متحجر راحتی شوند بر هستی فردی هیچگونه سیطره ای ندارند"},{"titles":"Barty Crusoe and His Man Saturday","authors":"Theodor Gomperz","id":5845285,"avg_rating":3.14,"tot_rating":14,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1354305455l\/5845285.jpg","description":"This is the story of a young boy named Barty, who after reading Robinson Crusoe, decides he wants to be on a desert island as well. He has a magical friend, the Good Wolf, who's able to make that happen for him. What kind of adventures will he be able to","genre":"Classics, Fiction, Childrens","format":"hardcover","page":231.0,"isbn":null,"au_ge":"theodorgomperz classics fiction childrens","key_words":"story adventures magical friend well reading robinson crusoe decides make kind able young boy named barty happen wants desert island good wolf whos","bow":"theodorgomperz classics fiction childrens story adventures magical friend well reading robinson crusoe decides make kind able young boy named barty happen wants desert island good wolf whos"},{"titles":"Novels of Anatole France: Penguin Island\/Crime of Sylvestre Bonnard\/Revolt of the Angels","authors":"Anton Chekhov","id":346025,"avg_rating":4.62,"tot_rating":13,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347840083l\/346025.jpg","description":"This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.","genre":"","format":"paperback","page":508.0,"isbn":9781419153037.0,"au_ge":"antonchekhov ","key_words":"original work marks notations marginalia believe worlds literature commitment flawed pages age true may contain imperfections due part facsimile reprint scarce antiquarian book protecting preserving made available affordable high quality modern editions promoting culturally important","bow":"antonchekhov  original work marks notations marginalia believe worlds literature commitment flawed pages age true may contain imperfections due part facsimile reprint scarce antiquarian book protecting preserving made available affordable high quality modern editions promoting culturally important"},{"titles":"The Missioner","authors":"Frances Hodgson Burnett","id":964153,"avg_rating":3.84,"tot_rating":19,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1180499439l\/964153.jpg","description":"E. Phillips Oppenheim (1866-1946), an English novelist, was the self-styled \"prince of storytellers.\" He composed some 150 novels, mainly suspense and international intrigue. He was the earliest writer of modern spy fiction and invented the \"Rogue Male\" school of adventure thr","genre":"","format":"hardcover","page":null,"isbn":null,"au_ge":"franceshodgsonburnett ","key_words":"modern spy fiction invented rogue male school english novelist earliest writer self styled prince international intrigue adventure thr e phillips oppenheim composed novels mainly suspense storytellers","bow":"franceshodgsonburnett  modern spy fiction invented rogue male school english novelist earliest writer self styled prince international intrigue adventure thr e phillips oppenheim composed novels mainly suspense storytellers"},{"titles":"Keziah Coffin","authors":"Anatole France","id":947214,"avg_rating":4.3,"tot_rating":23,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1422223468l\/947214.jpg","description":"He paused in spite of himself. His church, his first church! He had accepted the call with pride and a determination to do his best, the very best that was in him, for the society and for the people whom he was to lead. Some of those people he had learned to love; many of them, he felt sure, loved him. His success, his popularity, the growth of the organization and the praise which had come to him because of it, all these had meant, and still meant, very much to him. No wonder he paused, but the pause was momentary.","genre":"Fiction","format":"hardcover","page":null,"isbn":null,"au_ge":"anatolefrance fiction","key_words":"love many call learned felt sure loved still meant praise come determination accepted church pause popularity society lead people organization wonder first spite growth momentary pride much paused best success","bow":"anatolefrance fiction love many call learned felt sure loved still meant praise come determination accepted church pause popularity society lead people organization wonder first spite growth momentary pride much paused best success"},{"titles":"Abaft the Funnel","authors":"E. Phillips Oppenheim","id":3167715,"avg_rating":3.05,"tot_rating":22,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1494274605l\/3167715._SX318_.jpg","description":"First Issue of the first printed Ed. with gilt lettering issued 2 months before the regular Ed.  Collection of previously uncollected short works by Rudyard Kipling including stories, poems and l","genre":"Fiction, Fantasy","format":"hardcover","page":360.0,"isbn":null,"au_ge":"ephillipsoppenheim fiction fantasy","key_words":"l gilt lettering issued months previously uncollected short works first printed ed regular collection rudyard kipling including stories poems issue","bow":"ephillipsoppenheim fiction fantasy l gilt lettering issued months previously uncollected short works first printed ed regular collection rudyard kipling including stories poems issue"},{"titles":"Valor of Ignorance","authors":"Joseph Crosby Lincoln","id":111870,"avg_rating":4.09,"tot_rating":11,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347595319l\/111870.jpg","description":"One of the foremost strategists of the American Army in the first decade of the twentieth century warns of the great danger of militarized Japan and forcasts -- 44 years before it actually happened -- the Japanese invasion of the Phili","genre":"","format":"paperback","page":392.0,"isbn":9781931541664.0,"au_ge":"josephcrosbylincoln ","key_words":"foremost strategists japanese invasion forcasts years actually happened one american army first decade phili great danger militarized japan twentieth century warns","bow":"josephcrosbylincoln  foremost strategists japanese invasion forcasts years actually happened one american army first decade phili great danger militarized japan twentieth century warns"},{"titles":"Lives of Themistocles, Aristides, Pericles, Alcibiades & Coriolanus, Demosthenes & Cicero, Caesar & Antony","authors":"Rudyard Kipling","id":6507985,"avg_rating":4.42,"tot_rating":12,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1278105629l\/6507985.jpg","description":"This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.","genre":"","format":"hardcover","page":389.0,"isbn":null,"au_ge":"rudyardkipling ","key_words":"elected book may appreciate reproduction either part believe scanning process preservation missing work understanding despite print valuable blurred pages poor pictures errant marks etc original artifact back hope continuing commitment occasional imperfections printed works worldwide introduced published culturally important enjoy bring","bow":"rudyardkipling  elected book may appreciate reproduction either part believe scanning process preservation missing work understanding despite print valuable blurred pages poor pictures errant marks etc original artifact back hope continuing commitment occasional imperfections printed works worldwide introduced published culturally important enjoy bring"},{"titles":"The New York Edition of Henry James: The Aspern Papers\/The Turn of the Screw\/The Liar\/The Two Faces","authors":"Homer Lea","id":1350016,"avg_rating":3.94,"tot_rating":17,"year_pub":"1909","img":null,"description":"This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.","genre":"Literature","format":"hardcover","page":null,"isbn":null,"au_ge":"homerlea literature","key_words":"elected book may appreciate reproduction either part believe scanning process preservation missing work understanding despite print valuable blurred pages poor pictures errant marks etc original artifact back hope continuing commitment occasional imperfections printed works worldwide introduced published culturally important enjoy bring","bow":"homerlea literature elected book may appreciate reproduction either part believe scanning process preservation missing work understanding despite print valuable blurred pages poor pictures errant marks etc original artifact back hope continuing commitment occasional imperfections printed works worldwide introduced published culturally important enjoy bring"},{"titles":"The Evolution of Life and Form","authors":"Plutarch","id":2188544,"avg_rating":3.45,"tot_rating":11,"year_pub":"1909","img":null,"description":"Four lectures delivered at the twenty-third anniversary meeting of the Theosophical Society at Adyar, Madras, 1898  1.) Ancient and Modern Science 2.) Functions of the Gods 3.) evolution of Life 4.) Evolution","genre":"","format":"hardcover","page":161.0,"isbn":null,"au_ge":"plutarch ","key_words":"modern science functions adyar madras ancient life evolution theosophical society twenty third anniversary meeting gods four lectures delivered","bow":"plutarch  modern science functions adyar madras ancient life evolution theosophical society twenty third anniversary meeting gods four lectures delivered"},{"titles":"Betty Wales & Co. (Betty Wales, #6)","authors":"Henry James","id":6480591,"avg_rating":3.92,"tot_rating":13,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1352563514l\/6480591.jpg","description":null,"genre":"","format":"hardcover","page":345.0,"isbn":null,"au_ge":"henryjames ","key_words":"","bow":"henryjames  "},{"titles":"The Need of Change","authors":"Annie Besant","id":1740072,"avg_rating":4.27,"tot_rating":11,"year_pub":"1909","img":null,"description":"The classic, hilarious tale of an extremely British couple's hospitality to a very American","genre":"Fiction, Humor, Comedy","format":null,"page":79.0,"isbn":null,"au_ge":"anniebesant fiction humor comedy","key_words":"extremely british couples hospitality classic hilarious tale american","bow":"anniebesant fiction humor comedy extremely british couples hospitality classic hilarious tale american"},{"titles":"Chinese Immigration","authors":"Margaret Warde","id":1895199,"avg_rating":4.67,"tot_rating":3,"year_pub":"1909","img":null,"description":"Reprint, as part of The American Immigration Collection, of original publication as, apparently, part of a series called \"American Public Pro","genre":"","format":null,"page":531.0,"isbn":null,"au_ge":"margaretwarde ","key_words":"series called american public pro original publication part apparently immigration collection reprint","bow":"margaretwarde  series called american public pro original publication part apparently immigration collection reprint"},{"titles":"A Little Journey to the Home of James Oliver, Great Business Men","authors":"Julian Street","id":5962452,"avg_rating":4.2,"tot_rating":5,"year_pub":"1909","img":null,"description":"\"Designed by Dard Hunter, printed in four colors on Boxmoor.\" Source: abebooks.com (see url","genre":"","format":null,"page":52.0,"isbn":null,"au_ge":"julianstreet ","key_words":"dard hunter printed four colors boxmoor source abebooks com see url designed","bow":"julianstreet  dard hunter printed four colors boxmoor source abebooks com see url designed"},{"titles":"Barbara Bellamy - A Public School Girl","authors":"Mary Roberts Coolidge","id":10988304,"avg_rating":5.0,"tot_rating":1,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1545098712l\/10988304._SX318_.jpg","description":"Barbara Bellamy had been brought up in solitude in an old country house by her grandfather, a scholarly and eccentric gentleman who educated her in the Classics. She neither met nor knew anyone else until she went to sc","genre":"","format":"hardcover","page":315.0,"isbn":null,"au_ge":"maryrobertscoolidge ","key_words":"old country house educated brought eccentric gentleman neither met knew anyone else barbara bellamy scholarly solitude went grandfather classics sc","bow":"maryrobertscoolidge  old country house educated brought eccentric gentleman neither met knew anyone else barbara bellamy scholarly solitude went grandfather classics sc"},{"titles":"Personal Religion in Egypt before Christianity","authors":"Elbert Hubbard","id":909884,"avg_rating":4.0,"tot_rating":1,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1183152563l\/909884.jpg","description":"This 1909 work by the father of modern Egyptology begins by tracing theories of consciousness and religion, and applying them to Egyptian documents dating back to 500 B.C. The author examines what the ancients believed about the world, the gods, and how to live. He covers their organizations, dwellings, and marriage customs as well.","genre":"Northern Africa, Egypt","format":"hardcover","page":null,"isbn":null,"au_ge":"elberthubbard northernafrica egypt","key_words":"religion consciousness work world live gods covers organizations dwellings well egyptian documents dating back ancients believed modern egyptology begins applying father author examines marriage customs b c tracing theories","bow":"elberthubbard northernafrica egypt religion consciousness work world live gods covers organizations dwellings well egyptian documents dating back ancients believed modern egyptology begins applying father author examines marriage customs b c tracing theories"},{"titles":"The Fairy Latchkey","authors":"May Baldwin","id":4311482,"avg_rating":0.0,"tot_rating":0,"year_pub":"1909","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1352663858l\/4311482.jpg","description":"A lonely little girl is given a key to fairyland and allowed to enter and hear stories, until her life is brightened by the coming of a new mother. Part of R.F. Fenno's Bed Time Fairies","genre":"","format":"hardcover","page":229.0,"isbn":null,"au_ge":"maybaldwin ","key_words":"hear stories life r f fennos bed time fairies new mother part allowed given key fairyland coming brightened lonely little girl enter","bow":"maybaldwin  hear stories life r f fennos bed time fairies new mother part allowed given key fairyland coming brightened lonely little girl enter"},{"titles":"Howards End","authors":"E.M. Forster","id":38374795,"avg_rating":3.96,"tot_rating":72007,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1518837828l\/38374795.jpg","description":"Howards End is a novel by E. M. Forster about social conventions, codes of conduct and relationships in turn-of-the-century England. A strong-willed and intelligent woman refuses to allow the pretensions of her husband's smug English family to ruin her life. Howards End is considered by some to be Forster's maste","genre":"Classics, Fiction, Literature, Historical, Historical Fiction","format":"paperback","page":318.0,"isbn":9781984295293.0,"au_ge":"emforster classics fiction literature historical historicalfiction","key_words":"turn social conventions codes ruin allow pretensions intelligent woman refuses forster forsters maste novel relationships strong willed life howards end e considered conduct husbands smug english family century england","bow":"emforster classics fiction literature historical historicalfiction turn social conventions codes ruin allow pretensions intelligent woman refuses forster forsters maste novel relationships strong willed life howards end e considered conduct husbands smug english family century england"},{"titles":"The Selected Poetry of Rainer Maria Rilke","authors":"Rainer Maria Rilke","id":46201,"avg_rating":4.4,"tot_rating":12632,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1343101334l\/46201.jpg","description":"Parallel German text and English translation.  The influence and popularity of Rilke’s poetry in America have never been greater than they are today, more than fifty years after his death. Rilke is unquestionably the most significant and compelling poet of romantic transformation, of spiritual quest, that the twentieth century has known. His poems of ecstatic identification with the world exert a seemingly endless fascination for contemporary readers.  In Stephen Mitchell’s versions, many readers feel that they have discovered an English rendering that captures the lyric intensity, fluency, and reach of Rilke’s poetry more accurately and convincingly than has ever been done before.  Mr. Mitchell is impeccable in his adherence to Rilke’s text, to his formal music, and to the complexity of his thoughts; at the same time, his work has authority and power as poetry in its own right. Few translators of any poet have arrived at the delicate balance of fidelity and originality that Mr. Mitchell has brought off with seeming effortlessness.  Originally published: New York : Random House, 1982.","genre":"Poetry, Classics, European Literature, German Literature, Literature, Fiction","format":"paperback","page":356.0,"isbn":9780679722014.0,"au_ge":"rainermariarilke poetry classics europeanliterature germanliterature literature fiction","key_words":"captures romantic transformation authority twentieth century stephen mitchell ’ power significant seemingly endless fascination ever originality text influence work brought contemporary readers formal music arrived fidelity convincingly popularity greater english rendering spiritual quest poet never complexity today known poetry done seeming effortlessness originally published new york random house death rilke america unquestionably discovered lyric intensity fluency versions many feel translators translation ecstatic identification world exert time fifty years poems accurately parallel german reach compelling mr right impeccable adherence thoughts delicate balance","bow":"rainermariarilke poetry classics europeanliterature germanliterature literature fiction captures romantic transformation authority twentieth century stephen mitchell ’ power significant seemingly endless fascination ever originality text influence work brought contemporary readers formal music arrived fidelity convincingly popularity greater english rendering spiritual quest poet never complexity today known poetry done seeming effortlessness originally published new york random house death rilke america unquestionably discovered lyric intensity fluency versions many feel translators translation ecstatic identification world exert time fifty years poems accurately parallel german reach compelling mr right impeccable adherence thoughts delicate balance"},{"titles":"The Notebooks of Malte Laurids Brigge","authors":"Rainer Maria Rilke","id":93405,"avg_rating":4.03,"tot_rating":6676,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348925210l\/93405.jpg","description":"The Notebooks of Malte Laurids Brigge is Rilke’s major prose work and was one of the earliest publications to introduce him to American readers. The very wide audience which Rilke’s work commands today will welcome the reissue in paperback of this extremely perceptive translation of the Notebooks by M. D. Herter Norton. A masterly translation of one of the first great modernist novels by one of the German language's greatest poets, in which a young man named Malte Laurids Brigge lives in a cheap room in Paris while his belongings rot in storage. Every person he sees seems to carry their death within them and with little but a library card to distinguish him from the city's untouchables, he thinks of the deaths, and ghosts, of his aristocratic family, of which he is the sole living descendant. Suffused with passages of lyrical brilliance, Rilke's semi-autobiographical novel is a moving and powerful coming-of-age story.","genre":"Fiction, Classics, European Literature, German Literature, Poetry, Literature","format":"paperback","page":237.0,"isbn":9780393308815.0,"au_ge":"rainermariarilke fiction classics europeanliterature germanliterature poetry literature","key_words":"welcome passages moving carry extremely perceptive translation cheap room powerful coming belongings rot wide audience distinguish german languages greatest poets notebooks one paperback aristocratic family herter norton death within deaths age story work commands today little storage every person american readers citys untouchables thinks ghosts malte laurids brigge sole living descendant suffused masterly major prose sees seems young man named lives reissue paris first great modernist novels library card lyrical brilliance rilkes semi autobiographical novel rilke ’ introduce earliest publications","bow":"rainermariarilke fiction classics europeanliterature germanliterature poetry literature welcome passages moving carry extremely perceptive translation cheap room powerful coming belongings rot wide audience distinguish german languages greatest poets notebooks one paperback aristocratic family herter norton death within deaths age story work commands today little storage every person american readers citys untouchables thinks ghosts malte laurids brigge sole living descendant suffused masterly major prose sees seems young man named lives reissue paris first great modernist novels library card lyrical brilliance rilkes semi autobiographical novel rilke ’ introduce earliest publications"},{"titles":"The Emerald City of Oz (Oz #6)","authors":"L. Frank Baum","id":179668,"avg_rating":3.88,"tot_rating":9113,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1172470903l\/179668._SY475_.jpg","description":"The Emerald City is built all of beautiful marbles in which are set a profusion of emeralds, every one exquisitely cut and of very great size. There are other jewels used in the decorations inside the houses and palaces, such as rubies, diamonds, sapphires, amethysts and turquoises. But in the streets and upon the outside of the buildings only emeralds appear, from which circumstance the place is named the Emerald City of Oz.","genre":"Fantasy, Classics, Fiction, Childrens","format":"hardcover","page":295.0,"isbn":9781587260230.0,"au_ge":"lfrankbaum fantasy classics fiction childrens","key_words":"built place buildings profusion named oz great size houses decorations inside emeralds appear upon set palaces outside every one exquisitely cut rubies diamonds sapphires amethysts beautiful marbles emerald city circumstance turquoises streets jewels used","bow":"lfrankbaum fantasy classics fiction childrens built place buildings profusion named oz great size houses decorations inside emeralds appear upon set palaces outside every one exquisitely cut rubies diamonds sapphires amethysts beautiful marbles emerald city circumstance turquoises streets jewels used"},{"titles":"Kilmeny of the Orchard","authors":"L.M. Montgomery","id":65769,"avg_rating":3.68,"tot_rating":6459,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1215010550l\/65769.jpg","description":"A sweet and moving romance from the author of the beloved Anne of Green Gables series!  Eric Marshall, recent college graduate, has the world at his feet. He’s handsome, popular, wealthy, and surprisingly, single. Living the bachelor lifestyle with his widowed father, he’s never given much thought to romance. When an old school friend asks Eric to substitute teach for him on Prince Edward Island while he recuperates from an illness, Eric thinks, why not? He’s got some time to kill before diving into the family business with his father, and the rustic island may be a good diversion for him.  Eric falls into the easy routine of island life, and his status as eligible bachelor endears him to the locals. Eric is still not thinking of romance, but he’s about to find it in a most unexpected place…  Kilmeny Gordon is sweet and smart and beautiful, perfect in every way but one: she can’t speak. She’s been sheltered all her life due to her disability and the scandal surrounding her birth. She wiles away her hours helping her aunt and uncle on the farm and playing her violin in her favorite secluded spot. When Eric stumbles into her hidden orchard, he brings a whole new world with him, and a friendship that both frightens her and thrills her. As the summer days grow longer and their friendship blossoms, sweet, silent Kilmeny, with her sunny enthusiasm and haunting music, manages to do what neither the co-eds of Queenslea College nor the village lasses of Lindsay have been able to do—capture Eric’s heart.  But Kilmeny knows he’ll soon have to go back to his life on the mainland, a world of business meetings and parties and prejudicial people—a world in which she’ll hold him back and never fit in. None of that matters to Eric, but how can he get her to accept that she’s the only woman he’ll ever love, when she is convinced that the only way to love him is to let him go?  Bonus Content: Introduction and Illustrations  Legacy Vintage Collection Enhanced eBooks have been professionally edited and professionally formatted for your favorite e-reader! Learn more at The Vintage Reader.","genre":"Classics, Fiction, Romance, Young Adult, Historical, Historical Fiction","format":"paperback","page":144.0,"isbn":9780553213775.0,"au_ge":"lmmontgomery classics fiction romance youngadult historical historicalfiction","key_words":"matters prince edward island hold ’ frightens favorite e reader learn wiles away sunny enthusiasm woman playing never given much thought parties mainland illness eric thinks go back status convinced still farm rustic may life widowed father romance violin beautiful perfect beloved anne falls speak whole new world unexpected place … kilmeny gordon diving feet bachelor lifestyle hours helping ever love surprisingly single living substitute teach fit sheltered handsome popular wealthy kill every way queenslea college accept sweet village lasses old school friend asks haunting music manages co eds neither locals summer days grow longer heart green gables series marshall recent graduate — capture vintage got one stumbles smart author thinking thrills business meetings secluded spot disability illustrations legacy collection enhanced ebooks prejudicial people able professionally formatted get lindsay recuperates brings none scandal surrounding knows good diversion easy routine let family birth hidden orchard edited bonus content introduction uncle eligible endears moving friendship time blossoms silent aunt soon due find","bow":"lmmontgomery classics fiction romance youngadult historical historicalfiction matters prince edward island hold ’ frightens favorite e reader learn wiles away sunny enthusiasm woman playing never given much thought parties mainland illness eric thinks go back status convinced still farm rustic may life widowed father romance violin beautiful perfect beloved anne falls speak whole new world unexpected place … kilmeny gordon diving feet bachelor lifestyle hours helping ever love surprisingly single living substitute teach fit sheltered handsome popular wealthy kill every way queenslea college accept sweet village lasses old school friend asks haunting music manages co eds neither locals summer days grow longer heart green gables series marshall recent graduate — capture vintage got one stumbles smart author thinking thrills business meetings secluded spot disability illustrations legacy collection enhanced ebooks prejudicial people able professionally formatted get lindsay recuperates brings none scandal surrounding knows good diversion easy routine let family birth hidden orchard edited bonus content introduction uncle eligible endears moving friendship time blossoms silent aunt soon due find"},{"titles":"Gora","authors":"Rabindranath Tagore","id":1268541,"avg_rating":4.23,"tot_rating":3104,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1182381908l\/1268541.jpg","description":"Vast in its scope and rich in thought Gora has been acclaimed as a monumental work in the history of Bengali fiction. The story reflects the social, political and religious scene in Bengal at the turn of the century. The forces that were operating in Bengal at that time were one of the intense nationalism and revival of ancient spiritual values and also that of liberal western thought. What makes Gora a great prose epic is not only its social content but also its brilliant story of self-searching, of resolution, of conflicts and of self discovery.","genre":"Fiction, Cultural, India, Classics, Asian Literature, Indian Literature, Novels, Historical, Historical Fiction, Literature, Drama, Historical, Literature","format":null,"page":580.0,"isbn":9783491961302.0,"au_ge":"rabindranathtagore fiction cultural india classics asianliterature indianliterature novels historical historicalfiction literature drama historical literature","key_words":"turn self discovery resolution rich bengal forces story reflects revival operating one social content century brilliant thought gora monumental work also intense nationalism acclaimed liberal western great prose epic makes bengali fiction religious scene vast history time political conflicts searching ancient spiritual values scope","bow":"rabindranathtagore fiction cultural india classics asianliterature indianliterature novels historical historicalfiction literature drama historical literature turn self discovery resolution rich bengal forces story reflects revival operating one social content century brilliant thought gora monumental work also intense nationalism acclaimed liberal western great prose epic makes bengali fiction religious scene vast history time political conflicts searching ancient spiritual values scope"},{"titles":"The Ransom of Red Chief","authors":"O. Henry","id":963839,"avg_rating":4.15,"tot_rating":5543,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1404495720l\/963839.jpg","description":"Starters are an introductory level to the new Oxford Bookworms Library, suitable for readers in their first or second years of learning English. The Starters series are original stories in a variety of formats: narrative, interactive, and comic strip. They contain glossaries and exercises and are carefully graded in structure and vocabulary. Cassettes are available for some titles.","genre":"Short Stories, Classics, Fiction, Humor, Young Adult","format":null,"page":32.0,"isbn":9780194232159.0,"au_ge":"ohenry shortstories classics fiction humor youngadult","key_words":"new oxford bookworms library suitable learning english introductory level structure formats narrative interactive original stories contain glossaries exercises starters vocabulary cassettes variety carefully graded series available readers first second years comic strip titles","bow":"ohenry shortstories classics fiction humor youngadult new oxford bookworms library suitable learning english introductory level structure formats narrative interactive original stories contain glossaries exercises starters vocabulary cassettes variety carefully graded series available readers first second years comic strip titles"},{"titles":"The Wendigo","authors":"Algernon Blackwood","id":1137702,"avg_rating":3.87,"tot_rating":3471,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1181290361l\/1137702.jpg","description":"Algernon Blackwood's classic tale, The Wendigo. An influential novella by one of the most best-known writers of fantasy and horror, set in a place and time Blackwood kne","genre":"Horror, Classics, Fiction, Short Stories, Fantasy","format":"paperback","page":48.0,"isbn":9781406905922.0,"au_ge":"algernonblackwood horror classics fiction shortstories fantasy","key_words":"time blackwood kne fantasy influential novella wendigo algernon blackwoods classic tale best known writers place horror set one","bow":"algernonblackwood horror classics fiction shortstories fantasy time blackwood kne fantasy influential novella wendigo algernon blackwoods classic tale best known writers place horror set one"},{"titles":"The Vagabond","authors":"Colette","id":89842,"avg_rating":3.96,"tot_rating":2273,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1317065540l\/89842.jpg","description":"Thirty-three years-old and recently divorced, Renée Néré has begun a new life on her own, supporting herself as a music-hall artist. Maxime, a rich and idle bachelor, intrudes on her independent existence and offers his love and the comforts of marriage. A provincial tour puts distance between them and enables Renée, in a moving series of letters and meditations, to resolve alone the struggle between her need to be loved, and her need to have a life and work of her own.","genre":"Fiction, Classics, Cultural, France, European Literature, French Literature","format":"paperback","page":252.0,"isbn":9780374528041.0,"au_ge":"colette fiction classics cultural france europeanliterature frenchliterature","key_words":"new life comforts rich offers recently divorced renée néré supporting loved moving series struggle work music hall artist maxime marriage idle bachelor intrudes begun enables independent existence love provincial tour puts distance need meditations letters resolve alone thirty three years old","bow":"colette fiction classics cultural france europeanliterature frenchliterature new life comforts rich offers recently divorced renée néré supporting loved moving series struggle work music hall artist maxime marriage idle bachelor intrudes begun enables independent existence love provincial tour puts distance need meditations letters resolve alone thirty three years old"},{"titles":"A Good Man in Africa","authors":"William Boyd","id":77837,"avg_rating":3.85,"tot_rating":3632,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1391181523l\/77837.jpg","description":"In the small African republic of Kinjanja, British diplomat Morgan Leafy bumbles heavily through his job. His love of women, his fondness for drink, and his loathing for the country prove formidable obstacles on his road to any kind of success. But when he becomes an operative in Operation Kingpin and is charged with monitoring the front runner in Kinjanja’s national elections, Morgan senses an opportunity to achieve real professional recognition and, more importantly, reassignment.  After he finds himself being blackmailed, diagnosed with a venereal disease, attempting bribery, and confounded with a dead body, Morgan realizes that very little is going according to plan.","genre":"Fiction, Cultural, Africa, Humor, Novels","format":"paperback","page":352.0,"isbn":9781400030026.0,"au_ge":"williamboyd fiction cultural africa humor novels","key_words":"road operative plan kinjanja british diplomat morgan leafy bumbles heavily achieve real professional recognition dead body realizes ’ country prove formidable obstacles monitoring job fondness kind small african republic importantly reassignment confounded front runner little national elections senses women love becomes going according operation kingpin blackmailed diagnosed charged venereal disease attempting bribery finds drink success opportunity loathing","bow":"williamboyd fiction cultural africa humor novels road operative plan kinjanja british diplomat morgan leafy bumbles heavily achieve real professional recognition dead body realizes ’ country prove formidable obstacles monitoring job fondness kind small african republic importantly reassignment confounded front runner little national elections senses women love becomes going according operation kingpin blackmailed diagnosed charged venereal disease attempting bribery finds drink success opportunity loathing"},{"titles":"The Tale of Mrs. Tittlemouse","authors":"Beatrix Potter","id":885498,"avg_rating":3.96,"tot_rating":3389,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348747194l\/885498.jpg","description":"Tale of Mrs. Titt","genre":"Childrens, Childrens, Picture Books, Classics, Fiction","format":"hardcover","page":58.0,"isbn":9780723247807.0,"au_ge":"beatrixpotter childrens childrens picturebooks classics fiction","key_words":"mrs titt tale","bow":"beatrixpotter childrens childrens picturebooks classics fiction mrs titt tale"},{"titles":"Creative Evolution","authors":"Henri Bergson","id":379659,"avg_rating":4.1,"tot_rating":1011,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347862501l\/379659.jpg","description":"While intelligence treats everything mechanically, instinct proceeds, so to speak, organically. If...we could ask and it could reply, it would give up to us the most intimate secrets of life. -from Chapter II Anticipating not only modern scientific theories of psychology but also those of cosmology, this astonishing book sets out a impressive goal for itself: to reconcile human biology with a theory of consciousness. First published in France in 1907, and translated into English in 1911, this work of wonder was esteemed at the time in scientific circles and in the popular culture alike for its profound explorations of perception and memory and its surprising conclusions about the nature and value of art. Contending that intuition is deeper than intellect and that the real consequence of evolution is a mental freedom to grow, to change, to seek and create novelty, Bergson reinvigorated the theory of evolution by refusing to see it as merely mechanistic. His expansion on Darwin remains one of the most original and important philosophical arguments for a scientific inquiry still under fire today. French philosopher HENRI BERGSON (1859-1941) was born in Paris. Among his works are Matter and Memory (1896), An Introduction to Metaphysics (1903), and The Two Sources of Morality and Religion (1932). He was awarded the Nobel Prize for Literature in 1927.","genre":"Philosophy, Nonfiction, Science, Cultural, France, Philosophy, Theory, Psychology, Philosophy, Metaphysics, Science, Biology, Nobel Prize, Biology, Evolution","format":"paperback","page":472.0,"isbn":9781596053090.0,"au_ge":"henribergson philosophy nonfiction science cultural france philosophy theory psychology philosophy metaphysics science biology nobelprize biology evolution","key_words":"original religion intellect astonishing book sets mental freedom us surprising conclusions seek memory change intelligence treats everything mechanically instinct proceeds reconcile human biology matter psychology refusing awarded morality literature cosmology art contending intimate secrets work could ask speak organically perception merely mechanistic also introduction english see important philosophical arguments evolution expansion metaphysics life chapter ii anticipating france wonder grow darwin remains one value would give impressive goal translated born works profound explorations real consequence time popular culture alike fire today french philosopher henri bergson deeper modern scientific theories create novelty reinvigorated consciousness first published nature inquiry still intuition two sources circles esteemed nobel prize reply paris among theory","bow":"henribergson philosophy nonfiction science cultural france philosophy theory psychology philosophy metaphysics science biology nobelprize biology evolution original religion intellect astonishing book sets mental freedom us surprising conclusions seek memory change intelligence treats everything mechanically instinct proceeds reconcile human biology matter psychology refusing awarded morality literature cosmology art contending intimate secrets work could ask speak organically perception merely mechanistic also introduction english see important philosophical arguments evolution expansion metaphysics life chapter ii anticipating france wonder grow darwin remains one value would give impressive goal translated born works profound explorations real consequence time popular culture alike fire today french philosopher henri bergson deeper modern scientific theories create novelty reinvigorated consciousness first published nature inquiry still intuition two sources circles esteemed nobel prize reply paris among theory"},{"titles":"Psmith in the City (Psmith, #2)","authors":"P.G. Wodehouse","id":149812,"avg_rating":4.07,"tot_rating":3040,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1389760416l\/149812.jpg","description":"Mike Jackson, cricketer and scion of a cricketing clan, has dreams of Cambridge upset by father's financial troubles, sent under Manager Bickersdyke to New Asiatic Bank. Thankfully fellow cricketer PSmith draws off his lavender gloves to work as well, especially unwanted attention to Manager. They squeeze in crick","genre":"Fiction, Humor, Classics, Humor, Comedy, European Literature, British Literature, Literature, Historical, Historical Fiction, Novels, Audiobook, Adult Fiction","format":"paperback","page":172.0,"isbn":9781426449925.0,"au_ge":"pgwodehouse fiction humor classics humor comedy europeanliterature britishliterature literature historical historicalfiction novels audiobook adultfiction","key_words":"scion dreams work mike jackson cricketer manager squeeze new asiatic bank thankfully fellow psmith draws crick bickersdyke well especially unwanted attention fathers financial troubles sent cricketing clan lavender gloves cambridge upset","bow":"pgwodehouse fiction humor classics humor comedy europeanliterature britishliterature literature historical historicalfiction novels audiobook adultfiction scion dreams work mike jackson cricketer manager squeeze new asiatic bank thankfully fellow psmith draws crick bickersdyke well especially unwanted attention fathers financial troubles sent cricketing clan lavender gloves cambridge upset"},{"titles":"The Magic City","authors":"E. Nesbit","id":97089,"avg_rating":3.97,"tot_rating":1823,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1330754756l\/97089.jpg","description":"Philip Haldane builds a play city out of odds and ends that comes to life, when his beloved sister Helen marries Lucy's father. But the nurse tears down the city and traps Lucy. Peter, The Deliverer, must perform seven valorous deeds, opposed by the Pretenderette, a mysterious veiled woman who wants to be Queen. Noah builds an ark and adventures","genre":"Fantasy, Fiction, Childrens, Classics, Adventure","format":"hardcover","page":212.0,"isbn":9781587170249.0,"au_ge":"enesbit fantasy fiction childrens classics adventure","key_words":"adventures odds ends life ark beloved sister helen marries lucys father traps lucy peter deliverer must perform seven valorous deeds opposed city comes pretenderette nurse tears wants philip haldane builds play mysterious veiled woman queen noah","bow":"enesbit fantasy fiction childrens classics adventure adventures odds ends life ark beloved sister helen marries lucys father traps lucy peter deliverer must perform seven valorous deeds opposed city comes pretenderette nurse tears wants philip haldane builds play mysterious veiled woman queen noah"},{"titles":"Carnacki, the Ghost Finder","authors":"William Hope Hodgson","id":345563,"avg_rating":3.77,"tot_rating":1816,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1332287258l\/345563.jpg","description":"Carnacki, the Ghost-Finder is a collection of supernatural detective short stories by author William Hope Hodgson. It was first published in 1913 by the English publisher Eveleigh Nash. In 1947, a new edition of 3,050 copies was published by Mycroft & Moran and included three additional stories. The Mycroft & Moran version is listed as No. 52 in Queen's Quorum: A History of the Detective-Crime Short Story As Revealed by the 100 Most Important Books Published in this Field Since 1845 by Ellery Queen.","genre":"Horror, Short Stories, Mystery, Fiction, Fantasy, Classics, Paranormal, Ghosts, Fantasy, Weird Fiction","format":"paperback","page":192.0,"isbn":9781406905748.0,"au_ge":"williamhopehodgson horror shortstories mystery fiction fantasy classics paranormal ghosts fantasy weirdfiction","key_words":"ghost finder carnacki included three additional stories mycroft moran version published collection new edition important books author william hope hodgson ellery queen field since history revealed first queens quorum english publisher eveleigh nash copies detective crime short story listed supernatural","bow":"williamhopehodgson horror shortstories mystery fiction fantasy classics paranormal ghosts fantasy weirdfiction ghost finder carnacki included three additional stories mycroft moran version published collection new edition important books author william hope hodgson ellery queen field since history revealed first queens quorum english publisher eveleigh nash copies detective crime short story listed supernatural"},{"titles":"The History of Mr. Polly","authors":"H.G. Wells","id":483583,"avg_rating":3.63,"tot_rating":1415,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1500974122l\/483583._SY475_.jpg","description":null,"genre":"Fiction, Classics, Humor, European Literature, British Literature","format":"paperback","page":227.0,"isbn":9780141441078.0,"au_ge":"hgwells fiction classics humor europeanliterature britishliterature","key_words":"","bow":"hgwells fiction classics humor europeanliterature britishliterature "},{"titles":"The Family from One End Street","authors":"Eve Garnett","id":594970,"avg_rating":4.04,"tot_rating":1920,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1560711032l\/594970._SY475_.jpg","description":"A story of everyday life in the big, happy Ruggles family who live in the small town of Otwell. The father is a dustman and the mother a washerwoman, but because they are poor the children find even greater opportunities for adventure in their ordinary","genre":"Childrens, Classics, Fiction","format":"paperback","page":308.0,"isbn":9780141317168.0,"au_ge":"evegarnett childrens classics fiction","key_words":"story live mother washerwoman poor small town ordinary adventure father otwell children find even greater opportunities big happy ruggles family dustman everyday life","bow":"evegarnett childrens classics fiction story live mother washerwoman poor small town ordinary adventure father otwell children find even greater opportunities big happy ruggles family dustman everyday life"},{"titles":"The Blue Afternoon","authors":"William Boyd","id":77850,"avg_rating":3.77,"tot_rating":2292,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1170901628l\/77850._SX318_.jpg","description":"Boyd, the author of A Good Man in Africa and Brazzaville Beach, here gives us something entirely new, part suspense, part romance, all grand storytelling.  A young woman, waylaid by an old man who claims to be her father, hears his story of corruption and intrigue as the two of them embark on a remarkable j","genre":"Fiction, Historical, Historical Fiction, Novels, Literature","format":"hardcover","page":367.0,"isbn":9780679432951.0,"au_ge":"williamboyd fiction historical historicalfiction novels literature","key_words":"story brazzaville beach africa old man grand storytelling young woman waylaid intrigue gives us something entirely new part suspense romance two boyd embark good author father hears corruption claims remarkable j","bow":"williamboyd fiction historical historicalfiction novels literature story brazzaville beach africa old man grand storytelling young woman waylaid intrigue gives us something entirely new part suspense romance two boyd embark good author father hears corruption claims remarkable j"},{"titles":"Don't Tell Alfred (Radlett & Montdore, #3)","authors":"Nancy Mitford","id":50727,"avg_rating":3.59,"tot_rating":1746,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1170371254l\/50727.jpg","description":"In this delightful comedy, Fanny—the quietly observant narrator of Nancy Mitford’s two most famous novels—finally takes center stage. Fanny Wincham—last seen as a young woman in The Pursuit of Love and Love in a Cold Climate—has lived contentedly for years as housewife to an absent-minded Oxford don, Alfred. But her life changes overnight when her beloved Alfred is appointed English Ambassador to Paris. Soon she finds herself mixing with royalty and Rothschilds while battling her hysterical predecessor, Lady Leone, who refuses to leave the premises. When Fanny’s tender-hearted secretary begins filling the embassy with rescued animals and her teenage sons run away from Eton and show up with a rock star in tow, things get entirely out of hand. Gleefully sending up the antics of mid-century high society, Don’t Tell Alfred is classic Mitford.","genre":"Fiction, Classics, Humor, European Literature, British Literature, Literature, Historical, Historical Fiction","format":"paperback","page":223.0,"isbn":9780881845976.0,"au_ge":"nancymitford fiction classics humor europeanliterature britishliterature literature historical historicalfiction","key_words":"hysterical predecessor lady leone rothschilds quietly observant narrator eton two ’ fanny tender hearted secretary begins filling show premises rescued animals alfred mid century high society life changes overnight rock star beloved refuses embassy tow things get entirely years tell paris soon royalty nancy mitford love hand gleefully sending mixing antics pursuit young woman famous novels — finally takes center stage wincham last seen delightful comedy cold climate leave finds teenage sons run away battling absent minded oxford lived contentedly classic housewife appointed english ambassador","bow":"nancymitford fiction classics humor europeanliterature britishliterature literature historical historicalfiction hysterical predecessor lady leone rothschilds quietly observant narrator eton two ’ fanny tender hearted secretary begins filling show premises rescued animals alfred mid century high society life changes overnight rock star beloved refuses embassy tow things get entirely years tell paris soon royalty nancy mitford love hand gleefully sending mixing antics pursuit young woman famous novels — finally takes center stage wincham last seen delightful comedy cold climate leave finds teenage sons run away battling absent minded oxford lived contentedly classic housewife appointed english ambassador"},{"titles":"Calculus Made Easy","authors":"Silvanus Phillips Thompson","id":818063,"avg_rating":4.21,"tot_rating":877,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1312067998l\/818063.jpg","description":"Calculus Made Easy has long been the most popular calculus primer, and this major revision of the classic math text makes the subject at hand still more comprehensible to readers of all levels. With a new introduction, three new chapters, modernized language and methods throughout, and an appendix of challenging and enjoyable practice problems, Calculus Made Easy has been thoroughly updated for the modern reader.","genre":"Science, Mathematics, Science, Nonfiction, Reference, Mathematics, Calculus, Education, Textbooks, Unfinished, Academic, Science, Engineering","format":"hardcover","page":336.0,"isbn":9780312185480.0,"au_ge":"silvanusphillipsthompson science mathematics science nonfiction reference mathematics calculus education textbooks unfinished academic science engineering","key_words":"thoroughly updated subject appendix enjoyable practice problems calculus made easy new introduction three chapters modernized language comprehensible readers hand still major revision long levels methods throughout challenging classic math text makes modern reader popular primer","bow":"silvanusphillipsthompson science mathematics science nonfiction reference mathematics calculus education textbooks unfinished academic science engineering thoroughly updated subject appendix enjoyable practice problems calculus made easy new introduction three chapters modernized language comprehensible readers hand still major revision long levels methods throughout challenging classic math text makes modern reader popular primer"},{"titles":"The Pictorial Key to the Tarot","authors":"Arthur Edward Waite","id":529520,"avg_rating":3.71,"tot_rating":1502,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347686254l\/529520.jpg","description":"This pictorial key contains a detailed description of each card in the world's most popular 78-card Rider-Waite tarot deck, along with regular and reversed me","genre":"Occult, Tarot, Occult, Reference, Nonfiction, Spirituality","format":"paperback","page":340.0,"isbn":9780877282181.0,"au_ge":"arthuredwardwaite occult tarot occult reference nonfiction spirituality","key_words":"reversed pictorial key contains worlds card regular popular rider waite tarot deck along detailed description","bow":"arthuredwardwaite occult tarot occult reference nonfiction spirituality reversed pictorial key contains worlds card regular popular rider waite tarot deck along detailed description"},{"titles":"The Getting of Wisdom","authors":"Henry Handel Richardson","id":673234,"avg_rating":3.52,"tot_rating":1260,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328022420l\/673234.jpg","description":"The subject of this book is a young woman: an awkward, insecure, restless and 'knowing' child who learns that self-realisation depends on rebellion and escape, but that the latter will first demand at least the semblance of conformity. In telling lies, Laura learns both the astonishing allure of fiction and the social costs of stepping beyond the bounds of propriety, gender, class, and family ties.  The novel is only in part a fictionalised account of Richardson's school years at the Presbyterian Ladies College, Melbourne, where (unlike her fictional counterpart) she was not only academically successful but also an outstanding student of music. Unusual for stories of school-life, The Getting of Wisdom was clearly aimed at a mature readership able to understand irony and a critique of the colonial educational provision of its day, including a determination to preserve sexual ignorance in young women.","genre":"Classics, Fiction, Cultural, Australia, Literature","format":"paperback","page":282.0,"isbn":9780702231797.0,"au_ge":"henryhandelrichardson classics fiction cultural australia literature","key_words":"escape mature readership able first demand knowing child learns day including conformity presbyterian ladies college melbourne astonishing allure determination unlike getting least subject propriety gender class colonial educational provision telling lies laura awkward insecure restless also family ties part self realisation depends richardsons school years music unusual life social costs rebellion wisdom book critique fictional counterpart fictionalised account fiction semblance stepping beyond stories young women woman preserve sexual ignorance understand irony outstanding student latter novel academically successful bounds clearly aimed","bow":"henryhandelrichardson classics fiction cultural australia literature escape mature readership able first demand knowing child learns day including conformity presbyterian ladies college melbourne astonishing allure determination unlike getting least subject propriety gender class colonial educational provision telling lies laura awkward insecure restless also family ties part self realisation depends richardsons school years music unusual life social costs rebellion wisdom book critique fictional counterpart fictionalised account fiction semblance stepping beyond stories young women woman preserve sexual ignorance understand irony outstanding student latter novel academically successful bounds clearly aimed"},{"titles":"Time and Free Will","authors":"Henri Bergson","id":379661,"avg_rating":3.99,"tot_rating":538,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1174321069l\/379661.jpg","description":"Internationally known and one of the most influential philosophers of his day (and for a time almost a cult figure in France, where his lectures drew huge crowds), Henri Bergson (1859-41) led a revolution in philosophical thought by rejecting traditional conceptual and abstract methods, and arguing that the intuition is deeper than the intellect. His speculations, especially about the nature of time, had a profound influence on many other philosophers, as well as on poets and novelists; they are said to have been the seed for À la recherce de temps perdu by Marcel Proust (whose cousin was Bergson's wife). Though his ideas were sometimes difficult to follow, Bergson was also a fine stylist, who once declared, \"there is nothing in philosophy which could not be said in everyday language,\" and who was awarded the Nobel Prize for Literature in 1927. In Time and Free Will, written as his doctoral thesis, Bergson tries to dispel the arguments against free will. These arguments, he shows, come from a confusion of different ideas of time. Physicists and mathematicians conceive of time as a measurable construct much like the spatial dimensions. But in human experience, life is perceived as a continuous and unmeasurable flow rather than as a succession of marked-off states of consciousness — something that can be measured not quantitatively, but only qualitatively. And because human personalities express themselves in acts that cannot be predicted, Bergson declares free will to be an observable fact. Students and teachers of philosophy are sure to welcome this inexpensive reprint of Bergson's classic, influential essay, long a staple of college philosophy courses.","genre":"Philosophy, Nonfiction, Cultural, France","format":"paperback","page":278.0,"isbn":9781402199394.0,"au_ge":"henribergson philosophy nonfiction cultural france","key_words":"welcome spatial dimensions said philosophical thought sure marked also poets arguing internationally known france novelists human experience life bergsons classic influential essay long time physicists staple many states marcel proust whose cousin different ideas philosophers abstract methods everyday language arguments rejecting traditional conceptual intuition seed measured written almost profound influence one sometimes difficult well predicted bergson declares free confusion inexpensive reprint wife though philosophy cannot à la recherce de temps perdu revolution personalities express mathematicians conceive intellect day observable fact students succession continuous literature qualitatively lectures drew huge crowds henri led quantitatively measurable construct much like college courses shows come consciousness — something nothing follow acts teachers fine stylist dispel deeper could unmeasurable flow rather cult figure nature declared nobel prize doctoral thesis tries perceived awarded speculations especially","bow":"henribergson philosophy nonfiction cultural france welcome spatial dimensions said philosophical thought sure marked also poets arguing internationally known france novelists human experience life bergsons classic influential essay long time physicists staple many states marcel proust whose cousin different ideas philosophers abstract methods everyday language arguments rejecting traditional conceptual intuition seed measured written almost profound influence one sometimes difficult well predicted bergson declares free confusion inexpensive reprint wife though philosophy cannot à la recherce de temps perdu revolution personalities express mathematicians conceive intellect day observable fact students succession continuous literature qualitatively lectures drew huge crowds henri led quantitatively measurable construct much like college courses shows come consciousness — something nothing follow acts teachers fine stylist dispel deeper could unmeasurable flow rather cult figure nature declared nobel prize doctoral thesis tries perceived awarded speculations especially"},{"titles":"Old Mother West Wind","authors":"Thornton W. Burgess","id":825750,"avg_rating":4.15,"tot_rating":1150,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1382758739l\/825750.jpg","description":"Perfect for gift-giving--a classic illustrated by Michael Hague, in a beautifully redesigned edition.  Thornton W. Burgess said that imagination was \"the birthright of every child.\" His Old Mother West Wind stories, first published in 1910, have worked their magic on generations of ch","genre":"Childrens, Classics, Fiction, Animals","format":"hardcover","page":96.0,"isbn":9780805072389.0,"au_ge":"thorntonwburgess childrens classics fiction animals","key_words":"michael hague ch gift giving worked birthright imagination generations every child perfect classic illustrated magic old mother west wind stories first published beautifully redesigned edition thornton w burgess said","bow":"thorntonwburgess childrens classics fiction animals michael hague ch gift giving worked birthright imagination generations every child perfect classic illustrated magic old mother west wind stories first published beautifully redesigned edition thornton w burgess said"},{"titles":"Burning Daylight","authors":"Jack London","id":1382939,"avg_rating":4.03,"tot_rating":1017,"year_pub":"1910","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347502322l\/1382939.jpg","description":"Burning Daylight takes place in the Yukon Territory in 1893. The main character, Elam Harnish, nicknamed \"Burning Daylight\" was the most successful entrepreneur of the Alaskan Gold Rush. The story of the main character was partially based upon the life of Oakland entrepreneur \"Borax\" Smith. Bringing his fortunes to the States he is cheated out of it by a crowd of money kings, and recovers it only at the muzzle of his gun. Embarking on a new life in California, he makes another fortune by underhanded means . . . only to find his corrupt life suddenly turned around by the love of a woman.","genre":"Classics, Fiction, Adventure, Historical, Historical Fiction, Literature, American, Novels, Literature","format":"paperback","page":339.0,"isbn":9781600961243.0,"au_ge":"jacklondon classics fiction adventure historical historicalfiction literature american novels literature","key_words":"new life makes another fortune alaskan gold rush oakland entrepreneur borax smith bringing states california underhanded means partially based upon corrupt suddenly turned around money kings woman main character elam harnish nicknamed burning daylight takes place love recovers gun embarking crowd story successful muzzle cheated fortunes find yukon territory","bow":"jacklondon classics fiction adventure historical historicalfiction literature american novels literature new life makes another fortune alaskan gold rush oakland entrepreneur borax smith bringing states california underhanded means partially based upon corrupt suddenly turned around money kings woman main character elam harnish nicknamed burning daylight takes place love recovers gun embarking crowd story successful muzzle cheated fortunes find yukon territory"}]