[{"titles":"Greenmantle (Richard Hannay #2)","authors":"John Buchan","id":161000,"avg_rating":3.76,"tot_rating":3650,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1314968556l\/161000.jpg","description":"It is November, 1915. Major-General Sir Richard Hannay, KCB, OBE, DSO, Legion of Honour, is called in to investigate rumours of an uprising in the Muslim world, and undertakes a perilous journey through enemy territory to meet his friend Sandy in Constantinople. Once there, he and his friends must thwart the Germans' plans to use religion to help them win the war, climaxing at the battle of Erzurum. (less)","genre":"Fiction, Adventure, Classics, Thriller, Mystery, Historical, Historical Fiction, Spy Thriller, Espionage","format":"paperback","page":204.0,"isbn":9781406942774.0,"au_ge":"johnbuchan fiction adventure classics thriller mystery historical historicalfiction spythriller espionage","key_words":"friend sandy perilous journey war climaxing uprising use religion meet called investigate rumours win undertakes erzurum less enemy territory help muslim world honour battle germans plans constantinople november major general sir richard hannay kcb obe dso legion friends must thwart","bow":"johnbuchan fiction adventure classics thriller mystery historical historicalfiction spythriller espionage friend sandy perilous journey war climaxing uprising use religion meet called investigate rumours win undertakes erzurum less enemy territory help muslim world honour battle germans plans constantinople november major general sir richard hannay kcb obe dso legion friends must thwart"},{"titles":"The Son of Tarzan (Tarzan, #4)","authors":"Edgar Rice Burroughs","id":589898,"avg_rating":3.79,"tot_rating":4212,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1176073415l\/589898.jpg","description":"Alexis Paulvitch, one of Tarzan's enemies, wants to get even, so he draws Tarzan's son, Jack, away from London, but Jack isn't so easy to capture and kill. He escapes, and makes a home among the apes as his father did. He becomes known as Korak the Killer, and meets a lovely young woman named Meriem. Narrow escapes, fun action, and a definite sense of adventure in the wilds of Africa make this a must-read book. (less)","genre":"Adventure, Fiction, Fantasy, Classics","format":"paperback","page":280.0,"isbn":9781576466421.0,"au_ge":"edgarriceburroughs adventure fiction fantasy classics","key_words":"africa make must read book less tarzans enemies wants adventure home among capture escapes father makes london definite sense korak jack isnt becomes known meets apes kill wilds alexis paulvitch one lovely young woman named meriem narrow fun action easy draws son away killer get even","bow":"edgarriceburroughs adventure fiction fantasy classics africa make must read book less tarzans enemies wants adventure home among capture escapes father makes london definite sense korak jack isnt becomes known meets apes kill wilds alexis paulvitch one lovely young woman named meriem narrow fun action easy draws son away killer get even"},{"titles":"Democracy and Education","authors":"John Dewey","id":369051,"avg_rating":4.03,"tot_rating":1781,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1418615001l\/369051.jpg","description":"In this book, written in 1916, Dewey tries to criticize and expand on the educational philosophies of Rousseau and Plato. Dewey's ideas were seldom adopted in America's public schools, although a number of his prescriptions have been continually advocated by those who have had to teach in them.","genre":"Education, Philosophy, Nonfiction, Politics, Teaching","format":"paperback","page":384.0,"isbn":9780684836317.0,"au_ge":"johndewey education philosophy nonfiction politics teaching","key_words":"dewey tries seldom adopted teach americas public schools although educational philosophies number plato deweys ideas book written continually advocated expand prescriptions rousseau criticize","bow":"johndewey education philosophy nonfiction politics teaching dewey tries seldom adopted teach americas public schools although educational philosophies number plato deweys ideas book written continually advocated expand prescriptions rousseau criticize"},{"titles":"Trifles","authors":"Susan Glaspell","id":1033755,"avg_rating":3.83,"tot_rating":4472,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1396886077l\/1033755.jpg","description":"Trifles is a one-act play by Susan Glaspell. Her short story, \"A Jury of Her Peers\", was adapted from the play a year after its debut. It was first performed by the Provincetown Players at the Wharf Theatre in Provincetown, Massachusetts on August 8, 1916. In the original play, Glaspell played the role of one of the characters, Mrs. Hale. It is frequently anthologized in American literature textbooks.  The play begins as the county attorney, the sherrif, Mr. Hale, Mrs. Peters, and Mrs. Hale enter the Wright's empty farm house. On prompting from the county attorney, Mr. Hale recounts his visit to the house the previous day, when he found Mrs. Wright behaving strangely and found her husband upstairs with a rope around his neck, dead. Mr. Hale notes that, when he questioned her, Mrs. Wright claimed that she was fast asleep when someone strangled her husband.  Often hailed as one of the quintessential feminist plays, 'Trifles' earned Glaspell a Pulitzer Prize and renewed literary recognition. (less)","genre":"Plays, Drama, Classics, Academic, School, Academic, Read For School, Fiction, Plays, Theatre, Feminism, Short Stories, Mystery","format":"hardcover","page":20.0,"isbn":9780887345814.0,"au_ge":"susanglaspell plays drama classics academic school academic readforschool fiction plays theatre feminism shortstories mystery","key_words":"american literature textbooks house one act play prompting wrights empty farm questioned county attorney mr hale recounts trifles provincetown players massachusetts quintessential feminist plays earned glaspell visit role husband upstairs begins first performed adapted characters mrs found pulitzer prize original played wright claimed rope around behaving strangely debut susan frequently anthologized enter sherrif peters fast asleep renewed literary recognition less previous day jury wharf theatre often hailed short story neck dead notes august someone strangled year peers","bow":"susanglaspell plays drama classics academic school academic readforschool fiction plays theatre feminism shortstories mystery american literature textbooks house one act play prompting wrights empty farm questioned county attorney mr hale recounts trifles provincetown players massachusetts quintessential feminist plays earned glaspell visit role husband upstairs begins first performed adapted characters mrs found pulitzer prize original played wright claimed rope around behaving strangely debut susan frequently anthologized enter sherrif peters fast asleep renewed literary recognition less previous day jury wharf theatre often hailed short story neck dead notes august someone strangled year peers"},{"titles":"Under Fire","authors":"Henri Barbusse","id":48176,"avg_rating":3.83,"tot_rating":1360,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1388293713l\/48176.jpg","description":"Based on his own experience of the Great War, Henri Barbusse's novel is a powerful account of one of the greatest horrors mankind has ever inflicted on itself.  For the group of ordinary men in the French Sixth Battalion, thrown together from all over France and longing for home, war is simply a matter of survival, lightened only by the arrival of their rations or a glimpse of a pretty girl or a brief reprieve in the hospital. Reminiscent of classics like Hemingway's A Farewell to Arms and Remarque's All Quiet on the Western Front, Under Fire (originally published in French as La Feu) vividly evokes life in the trenches: the mud, stench, and monotony of waiting while constantly fearing for one's life in an infernal and seemingly eternal battlefield.  For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators. (less)","genre":"Fiction, War, War, World War I, Cultural, France, Historical, Historical Fiction","format":"paperback","page":352.0,"isbn":9780143039044.0,"au_ge":"henribarbusse fiction war war worldwari cultural france historical historicalfiction","key_words":"global bookshelf western front infernal greatest horrors mankind ever inflicted fire originally published introductions ones life arms matter across genres one french award winning translators less trenches leading publisher well hospital reminiscent la feu vividly evokes pretty girl ordinary men simply longing home war seemingly eternal battlefield best works throughout history date translations sixth battalion thrown together monotony constantly fearing remarques france series rations group arrival classic literature experience provide authoritative texts enhanced mud stench survival lightened classics like hemingways disciplines readers trust titles penguin represents farewell great henri barbusses novel glimpse contemporary authors seventy years based notes powerful account waiting english speaking world brief reprieve quiet distinguished scholars","bow":"henribarbusse fiction war war worldwari cultural france historical historicalfiction global bookshelf western front infernal greatest horrors mankind ever inflicted fire originally published introductions ones life arms matter across genres one french award winning translators less trenches leading publisher well hospital reminiscent la feu vividly evokes pretty girl ordinary men simply longing home war seemingly eternal battlefield best works throughout history date translations sixth battalion thrown together monotony constantly fearing remarques france series rations group arrival classic literature experience provide authoritative texts enhanced mud stench survival lightened classics like hemingways disciplines readers trust titles penguin represents farewell great henri barbusses novel glimpse contemporary authors seventy years based notes powerful account waiting english speaking world brief reprieve quiet distinguished scholars"},{"titles":"Tarzan and the Jewels of Opar (Tarzan, #5)","authors":"Edgar Rice Burroughs","id":474111,"avg_rating":3.83,"tot_rating":3427,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1391967545l\/474111.jpg","description":"Here Tarzan returns to Opar, the source of the gold for lost Atlantis. Ages ago Atlantis sunk beneath the waves -- but the denizens of Opar still mine the gold of this lost colony. Tarzan, following greedy pair -- one Belgian, one Arab -- into the jungle, where they stumble into the lost city. Bad enough -- and then Tarzan injures his head in a fight and loses his memory. That's great news for La, the high priestess for the Flaming God, who's had a serious crush on the apeman since their first encounter. But the priests who work for her have other ideas: they don't intend to allow Tarzan to escape their sacrificial knives a second time. (less)","genre":"Adventure, Fiction, Fantasy, Classics","format":"hardcover","page":264.0,"isbn":9781421807102.0,"au_ge":"edgarriceburroughs adventure fiction fantasy classics","key_words":"opar still mine escape denizens flaming god whos sacrificial knives lost colony tarzan following greedy pair one belgian arab waves fight source work apeman since priests high priestess second time less returns la city bad enough head injures allow first encounter stumble dont intend gold memory thats great news ideas atlantis ages ago sunk beneath jungle loses serious crush","bow":"edgarriceburroughs adventure fiction fantasy classics opar still mine escape denizens flaming god whos sacrificial knives lost colony tarzan following greedy pair one belgian arab waves fight source work apeman since priests high priestess second time less returns la city bad enough head injures allow first encounter stumble dont intend gold memory thats great news ideas atlantis ages ago sunk beneath jungle loses serious crush"},{"titles":"Selected Stories","authors":"Robert Walser","id":160313,"avg_rating":4.21,"tot_rating":1269,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1320472249l\/160313.jpg","description":"How to place the mysterious Swiss writer Robert Walser, a humble genius who possessed one of the most elusive and surprising sensibilities in modern literature? Walser is many things: a Paul Klee in words, maker of droll, whimsical, tender, and heartbreaking verbal artifacts; an inspiration to such very different writers as Kafka and W.G. Sebald; an amalgam, as Susan Sontag suggests in her preface to this volume, of Stevie Smith and Samuel Beckett.  This collection gathers forty-two of Walser's stories. Encompassing everything from journal entries, notes on literature, and biographical sketches to anecdotes, fables, and visions, it is an ideal introduction to this fascinating writer of whom Hermann Hesse famously declared, \"If he had a hundred thousand readers, the world would be a better place.\"  Response to a Request Flower Days Trousers Two Strange Stories Balloon Journey Kleist in Thum The Job Application The Boat A Little Ramble Helbling's Story The Little Berliner Nervous The Walk So! \"I've Got You\" Nothing at All Kienast Poests Frau Wilke The Street Snowdrops Winter The She-Owl Knocking Titus Vladimir Parisian Newspapers The Monkey Dostoevsky's Idiot Am I Dreaming? The Little Tree Stork and Porcupine A Contribution to the Celebration of Conrad Ferdinand Meyer A Sort of Speech A Letter to Therese Breitbach A Village Tale The Aviator The Pimp Masters and Workers Essay on Freedom A Biedermeier Story The Honeymoon Thoughts on Cezanne (less)","genre":"Short Stories, Fiction, Literature, European Literature, German Literature","format":"paperback","page":208.0,"isbn":9780940322981.0,"au_ge":"robertwalser shortstories fiction literature europeanliterature germanliterature","key_words":"therese breitbach pimp masters surprising sensibilities porcupine w g sebald hundred thousand readers sort stevie smith biedermeier story volume elusive little ramble helblings possessed one world would susan sontag suggests place owl knocking titus vladimir parisian newspapers aviator amalgam literature dreaming street snowdrops winter tree stork letter cezanne less conrad ferdinand meyer walk journal entries notes modern walser monkey dostoevskys idiot freedom words maker better response berliner nervous paul klee many things heartbreaking verbal artifacts collection gathers forty two walsers stories encompassing everything anecdotes fables ideal introduction job application nothing contribution speech ive got request flower days trousers strange balloon journey kleist mysterious swiss writer robert samuel beckett thum workers essay humble genius visions droll whimsical tender inspiration hermann hesse famously declared celebration village tale preface kafka different writers biographical sketches fascinating boat honeymoon thoughts kienast poests frau wilke","bow":"robertwalser shortstories fiction literature europeanliterature germanliterature therese breitbach pimp masters surprising sensibilities porcupine w g sebald hundred thousand readers sort stevie smith biedermeier story volume elusive little ramble helblings possessed one world would susan sontag suggests place owl knocking titus vladimir parisian newspapers aviator amalgam literature dreaming street snowdrops winter tree stork letter cezanne less conrad ferdinand meyer walk journal entries notes modern walser monkey dostoevskys idiot freedom words maker better response berliner nervous paul klee many things heartbreaking verbal artifacts collection gathers forty two walsers stories encompassing everything anecdotes fables ideal introduction job application nothing contribution speech ive got request flower days trousers strange balloon journey kleist mysterious swiss writer robert samuel beckett thum workers essay humble genius visions droll whimsical tender inspiration hermann hesse famously declared celebration village tale preface kafka different writers biographical sketches fascinating boat honeymoon thoughts kienast poests frau wilke"},{"titles":"Chicago Poems","authors":"Carl Sandburg","id":596810,"avg_rating":4.03,"tot_rating":2239,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1327932916l\/596810.jpg","description":null,"genre":"Poetry, Classics, Fiction","format":"paperback","page":88.0,"isbn":null,"au_ge":"carlsandburg poetry classics fiction","key_words":"","bow":"carlsandburg poetry classics fiction "},{"titles":"Bunner Sisters","authors":"Edith Wharton","id":2288934,"avg_rating":3.71,"tot_rating":1393,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1388920231l\/2288934.jpg","description":"\"Bunner Sisters,\" written in 1892 but not published until 1916 in Xingu and Other Stories, takes place in a shabby neighborhood in New York City. The two Bunner sisters, Ann Eliza the elder, and Evelina the younger, keep a small shop selling artificial flowers and small handsewn articles to Stuyvesant Square's \"female population.\" Ann Eliza gives Evelina a clock for her birthday. The clock leads the sisters to become involved with Herbert Ramy, owner of \"the queerest little store you ever laid eyes on.\" Soon Ramy is a regular guest of the Bunner sisters, who realize that their \"treadmill routine,\" once so comfortable, is now \"intolerably monotonous.\" (less)","genre":"Classics, Fiction","format":"paperback","page":136.0,"isbn":9781421804293.0,"au_ge":"edithwharton classics fiction","key_words":"younger keep evelina birthday published queerest little store clock elder sisters shabby neighborhood become involved stuyvesant squares female population ann eliza gives regular guest small handsewn articles comfortable new york city two bunner treadmill routine realize shop selling artificial flowers stories takes place herbert ramy owner xingu ever laid eyes leads written intolerably monotonous less soon","bow":"edithwharton classics fiction younger keep evelina birthday published queerest little store clock elder sisters shabby neighborhood become involved stuyvesant squares female population ann eliza gives regular guest small handsewn articles comfortable new york city two bunner treadmill routine realize shop selling artificial flowers stories takes place herbert ramy owner xingu ever laid eyes leads written intolerably monotonous less soon"},{"titles":"The Lost Continent","authors":"Edgar Rice Burroughs","id":29514,"avg_rating":3.68,"tot_rating":1742,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347566778l\/29514.jpg","description":"The year is 2137. Two hundred years ago -- in our time, more or less -- Eurasia fought a war to end all wars, a war that meant, for all intents and purposes, the end of the Old World. The Americas managed to retain their civilization -- but only by engaging by the most extreme form or isolationism imaginable for two centuries, now, no American has ventured east of the thirtieth parallel. \"East for the East . . .\" the slogan went, \"The West for the West!\" Until a terrible storm at sea forced American lieutenant Jefferson Turck to disobey the law, seeking safe harbor in England -- where he found that two centuries of isolation have desolated the land. The damaged ship found a Europe that is no longer an enemy -- a ruined land that is utterly unable to be an enemy -- or a friend. (less)","genre":"Science Fiction, Fiction, Fantasy, Classics, Adventure, Science Fiction Fantasy, Pulp, Apocalyptic, Post Apocalyptic, Science Fiction, Alternate History, Action","format":"paperback","page":108.0,"isbn":9781600961502.0,"au_ge":"edgarriceburroughs sciencefiction fiction fantasy classics adventure sciencefictionfantasy pulp apocalyptic postapocalyptic sciencefiction alternatehistory action","key_words":"civilization americas managed sea forced american lieutenant jefferson turck ruined land war two hundred years ago end ventured east slogan went retain thirtieth parallel wars found extreme form meant utterly unable disobey england less eurasia fought enemy law seeking safe harbor engaging europe time friend desolated isolationism imaginable terrible storm isolation damaged ship longer west purposes intents old world year centuries","bow":"edgarriceburroughs sciencefiction fiction fantasy classics adventure sciencefictionfantasy pulp apocalyptic postapocalyptic sciencefiction alternatehistory action civilization americas managed sea forced american lieutenant jefferson turck ruined land war two hundred years ago end ventured east slogan went retain thirtieth parallel wars found extreme form meant utterly unable disobey england less eurasia fought enemy law seeking safe harbor engaging europe time friend desolated isolationism imaginable terrible storm isolation damaged ship longer west purposes intents old world year centuries"},{"titles":"Priče iz davnine","authors":"Ivana Brlić-Mažuranić","id":4576186,"avg_rating":4.17,"tot_rating":2010,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1279745583l\/4576186.jpg","description":"Priče iz davnine, glasovita zbirka od osam pripovijetki-bajki Ivane Brlić-Mažuranić, u kojima je autorica ostvarila svoj književni vrhunac. Zbirka je objavljena 1916. u izdanju Matice hrvatske, a drugo izdanje doživljava 1926.  Radnju pokreću likovi iz pretkršćanske, slavenske mitologije, koje je Brlić-Mažuranić, inače i dvostruka kandidatkinja za Nobelovu nagradu za književnost, stilizirala davši im određene osobine. Posluživši se oblikom bajke i fantastičnim elementima, stvorila je autonomni svijet davnine u kojem se mitski svijet spaja sa secesijski stiliziranom slikom vremena, prostora, likova i događaja. Prvo izdanje je imalo šest priča, a u drugom izdanju su dodane još dvije.  Croatian Tales of Long Ago (Croatian: Priče iz davnine), is a short story collection written by the acclaimed children's author Ivana Brlić-Mažuranić (sometimes spelled as \"Ivana Berlić-Mažuranić\" in English), originally published in 1916 in Zagreb by the Matica hrvatska publishing house. The collection is considered her masterpiece and it features a series of newly written fairy tales heavily inspired by motifs taken from ancient Slavic mythology of pre-Christian Croatia.  Croatian Tales of Long Ago are seen as one of the most typical examples of her writing style which has been compared by literary critics to Hans Christian Andersen and J. R. R. Tolkien due to the way it combines original fantasy plots with folk mythology. Summary by Wikipedia (less)","genre":"Classics, Childrens, Fantasy","format":"hardcover","page":213.0,"isbn":9789531967976.0,"au_ge":"ivanabrlić-mažuranić classics childrens fantasy","key_words":"folk mythology summary long ago wikipedia less priče iz davnine glasovita zbirka od osam pripovijetki bajki ivane brlić mažuranić u kojima je autorica ostvarila svoj književni vrhunac objavljena izdanju matice hrvatske seen zagreb događaja prvo izdanje imalo šest priča writing style english originally published collection short story written acclaimed childrens author ivana sometimes spelled one newly fairy tales heavily inspired motifs taken berlić way combines original fantasy plots series drugo doživljava radnju pokreću likovi pretkršćanske slavenske mitologije koje inače matica hrvatska publishing house masterpiece considered literary critics dvostruka kandidatkinja za nobelovu nagradu književnost stilizirala davši im određene osobine posluživši se oblikom bajke croatian hans christian andersen compared features drugom su dodane još dvije ancient slavic pre croatia j r tolkien due typical examples fantastičnim elementima stvorila autonomni svijet kojem mitski spaja sa secesijski stiliziranom slikom vremena prostora likova","bow":"ivanabrlić-mažuranić classics childrens fantasy folk mythology summary long ago wikipedia less priče iz davnine glasovita zbirka od osam pripovijetki bajki ivane brlić mažuranić u kojima je autorica ostvarila svoj književni vrhunac objavljena izdanju matice hrvatske seen zagreb događaja prvo izdanje imalo šest priča writing style english originally published collection short story written acclaimed childrens author ivana sometimes spelled one newly fairy tales heavily inspired motifs taken berlić way combines original fantasy plots series drugo doživljava radnju pokreću likovi pretkršćanske slavenske mitologije koje inače matica hrvatska publishing house masterpiece considered literary critics dvostruka kandidatkinja za nobelovu nagradu književnost stilizirala davši im određene osobine posluživši se oblikom bajke croatian hans christian andersen compared features drugom su dodane još dvije ancient slavic pre croatia j r tolkien due typical examples fantastičnim elementima stvorila autonomni svijet kojem mitski spaja sa secesijski stiliziranom slikom vremena prostora likova"},{"titles":"The Little Lady of the Big House","authors":"Jack London","id":363976,"avg_rating":3.9,"tot_rating":1644,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1174119347l\/363976._SY475_.jpg","description":"This novel features a love triangle between a rancher, Dick Forrest, his wife, Paula, and her lover, Evan Graham. All characters can be traced back to London and his friends and family. London called the novel \"all sex from start to finish--in which no sexual adventure is actually achieved or comes within a million miles of being achieved, and in which, nevertheless, is all the guts of sex....\" (less)","genre":"Classics, Fiction, Literature, American, Novels","format":"paperback","page":244.0,"isbn":9781406932232.0,"au_ge":"jacklondon classics fiction literature american novels","key_words":"love triangle lover evan graham comes within family london called sexual adventure nevertheless novel features start traced back friends sex less achieved wife paula guts million miles characters rancher dick forrest finish actually","bow":"jacklondon classics fiction literature american novels love triangle lover evan graham comes within family london called sexual adventure nevertheless novel features start traced back friends sex less achieved wife paula guts million miles characters rancher dick forrest finish actually"},{"titles":"The Theory of the Novel","authors":"György Lukács","id":189603,"avg_rating":3.86,"tot_rating":1016,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1404169080l\/189603.jpg","description":"Georg Lukacs wrote The Theory of the Novel in 1914-1915, a period that also saw the conception of Rosa Luxemburg's Spartacus Letters, Lenin's Imperialism: The Highest Stage of Capitalism, Spengler's Decline of the West, and Ernst Bloch's Spirit of Utopia. Like many of Lukacs's early essays, it is a radical critique of bourgeois culture and stems from a specific Central European philosophy of life and tradition of dialectical idealism whose originators include Kant, Hegel, Novalis, Marx, Kierkegaard, Simmel, Weber, and Husserl.  The Theory of the Novel marks the transition of the Hungarian philosopher from Kant to Hegel and was Lukacs's last great work before he turned to Marxism-Leninism. (less)","genre":"Philosophy, Philosophy, Theory, Criticism, Literary Criticism, Nonfiction, Literature, Criticism","format":"paperback","page":160.0,"isbn":9780262620277.0,"au_ge":"györgylukács philosophy philosophy theory criticism literarycriticism nonfiction literature criticism","key_words":"utopia like many ernst blochs spirit highest stage husserl novel marks hungarian philosopher turned lukacss last great work bourgeois culture rosa luxemburgs spartacus letters lenins imperialism also saw specific central european philosophy stems kant hegel life georg lukacs wrote marxism leninism less tradition conception transition early essays west radical critique dialectical idealism whose originators include novalis marx kierkegaard simmel weber capitalism spenglers decline theory period","bow":"györgylukács philosophy philosophy theory criticism literarycriticism nonfiction literature criticism utopia like many ernst blochs spirit highest stage husserl novel marks hungarian philosopher turned lukacss last great work bourgeois culture rosa luxemburgs spartacus letters lenins imperialism also saw specific central european philosophy stems kant hegel life georg lukacs wrote marxism leninism less tradition conception transition early essays west radical critique dialectical idealism whose originators include novalis marx kierkegaard simmel weber capitalism spenglers decline theory period"},{"titles":"A Thousand-Mile Walk to the Gulf","authors":"John Muir","id":238738,"avg_rating":3.92,"tot_rating":888,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1389157257l\/238738.jpg","description":"Here is the adventure that started John Muir on a lifetime of discovery. Taken from his earliest journals, this book records Muir's walk in 1867 from Indiana across Kentucky, Tennessee, North Carolina, Georgia, and Florida to the Gulf Coast. In his distinct and wonderful style, Muir shows us the wilderness, as well as the towns and people, of the South immediately after the Civil War. (less)","genre":"Environment, Nature, Nonfiction, Travel, Autobiography, Memoir, Biography, History","format":"paperback","page":272.0,"isbn":9780395901472.0,"au_ge":"johnmuir environment nature nonfiction travel autobiography memoir biography history","key_words":"people well earliest journals florida civil war less gulf coast adventure distinct indiana across kentucky tennessee north carolina georgia book records muirs walk south immediately wilderness towns started john muir lifetime wonderful style shows us discovery taken","bow":"johnmuir environment nature nonfiction travel autobiography memoir biography history people well earliest journals florida civil war less gulf coast adventure distinct indiana across kentucky tennessee north carolina georgia book records muirs walk south immediately wilderness towns started john muir lifetime wonderful style shows us discovery taken"},{"titles":"The Best of Saki","authors":"Saki","id":71012,"avg_rating":4.2,"tot_rating":1279,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1483095387l\/71012.jpg","description":"A collection of eight cases, contains examples -The Bruce Partington Plans-The Dying Detective, Wisteria Lodge & The devils Foot","genre":"Short Stories, Fiction, Classics, Humor, European Literature, British Literature","format":"paperback","page":256.0,"isbn":null,"au_ge":"saki shortstories fiction classics humor europeanliterature britishliterature","key_words":"devils foot eight cases contains examples bruce partington plans dying detective wisteria lodge collection","bow":"saki shortstories fiction classics humor europeanliterature britishliterature devils foot eight cases contains examples bruce partington plans dying detective wisteria lodge collection"},{"titles":"One Hundred and One Famous Poems: With a Prose Supplement","authors":"Roy Jay Cook","id":304728,"avg_rating":4.28,"tot_rating":1167,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1369822640l\/304728.jpg","description":"Nature, man and human history are reflected on in the verse of English and American poets and such prose works as the Gettysburg Address and the Declaration of Independence.","genre":"Poetry, Classics, Fiction","format":null,"page":186.0,"isbn":9780809288311.0,"au_ge":"royjaycook poetry classics fiction","key_words":"verse independence human history reflected declaration american poets gettysburg address prose works english nature man","bow":"royjaycook poetry classics fiction verse independence human history reflected declaration american poets gettysburg address prose works english nature man"},{"titles":"Uneasy Money","authors":"(Compilation)","id":764726,"avg_rating":4.03,"tot_rating":1503,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347515982l\/764726.jpg","description":"Uneasy Money sees the hard-up Lord Dawlish off to America to make a fortune.","genre":"Fiction, Humor, Classics, Humor, Comedy","format":"hardcover","page":256.0,"isbn":9781841591322.0,"au_ge":"(compilation) fiction humor classics humor comedy","key_words":"fortune make hard america uneasy money sees lord dawlish","bow":"(compilation) fiction humor classics humor comedy fortune make hard america uneasy money sees lord dawlish"},{"titles":"The Power of Concentration","authors":"P.G. Wodehouse","id":90102,"avg_rating":3.75,"tot_rating":887,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347272990l\/90102.jpg","description":"It is of the utmost value to learn how to concentrate. To make the greatest success of anything you must be able to concentrate your entire thought upon the idea you are working on. The person that is able to concentrate utilizes all constructive thoughts and shuts out all destructive ones. The greatest man would accomplish nothing if he lacked concentration.  This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide. (less)","genre":"Self Help, Psychology, Nonfiction, Self Help, Personal Development, Productivity, Business, Audiobook, Education, Spirituality","format":"paperback","page":140.0,"isbn":9781426400209.0,"au_ge":"pgwodehouse selfhelp psychology nonfiction selfhelp personaldevelopment productivity business audiobook education spirituality","key_words":"elected constructive thoughts utmost value bring reading experience pre historical reproduction believe printed works worldwide less shuts attempt books may made best efforts quality assurance destructive ones imperfections introduced work book back occasional errors greatest man would accomplish nothing part print curated remove make success working conducted concentrate lacked concentration anything learn impede idea utilizes preservation continuing commitment able person must entire thought upon culturally important digitization process though","bow":"pgwodehouse selfhelp psychology nonfiction selfhelp personaldevelopment productivity business audiobook education spirituality elected constructive thoughts utmost value bring reading experience pre historical reproduction believe printed works worldwide less shuts attempt books may made best efforts quality assurance destructive ones imperfections introduced work book back occasional errors greatest man would accomplish nothing part print curated remove make success working conducted concentrate lacked concentration anything learn impede idea utilizes preservation continuing commitment able person must entire thought upon culturally important digitization process though"},{"titles":"The Alchemist","authors":"William Walker Atkinson","id":11554621,"avg_rating":3.4,"tot_rating":1625,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1339023458l\/11554621.jpg","description":null,"genre":"Horror, Short Stories, Fantasy, Horror, Lovecraftian, Classics, Fiction, Mystery","format":null,"page":10.0,"isbn":null,"au_ge":"williamwalkeratkinson horror shortstories fantasy horror lovecraftian classics fiction mystery","key_words":"","bow":"williamwalkeratkinson horror shortstories fantasy horror lovecraftian classics fiction mystery "},{"titles":"Just David","authors":"H.P. Lovecraft","id":1000752,"avg_rating":4.17,"tot_rating":933,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1387725470l\/1000752.jpg","description":"Eleanor Porter wrote this wonderful novel two years after the runaway success of her book Pollyanna. Though also a bestseller at the time, Just David has rarely been reprinted since its release in 1916. We felt a story this good shouldn’t be so hard to find, so we decided to put it back in print last year. Now it’s in a longer-lasting hardcover.  It is the story of David, a charming little boy of 10 who is suddenly transplanted from a world of music (he plays the violin) in the mountains with his father, to the provincialism of a workaday small town. But even more, it is the story of how David transplants his own character, courage and happiness into the lives of the people he meets, and wins their love and respect. Here’s what we say in the preface to the new edition:  Just David is a quiet, unassuming children’s novel about an orphaned young boy with a mysterious past. David, not the typical boy found in most stories of his day, is a mixture of simplicity and complexity whose disarming innocence has a profound effect on the people he encounters. Unlike the “good bad boy” often encountered in children’s literature, David is a “good good” boy. He is not in any way “goody-goody” in the moralistic sense, but simply and purely good. David’s goodness is not a mysterious quality that defies logic and imagination, but rather a quality cultivated in him by the intentional efforts of a wise and loving father. During David’s formative years, his father secluded him from the influences of the outside world, creating a private world in the mountains filled with simple pleasures, purposeful study, and beautiful music. David’s touching story is well within the scope of the imagination, and David’s endearing innocence, engaging personality, and natural character are unforgettable.  Just David struck a resonant chord in our family for several reasons. First, David’s life affirms the biblical principle expressed in the proverb, “He who walks with the wise grows wise, but a companion of fools suffers harm”. David walked with his father and became wise. Also, his story reminds us of the importance of creating the right “appetite” early in our children’s lives. David’s love of music, nature and beauty were intentionally cultivated in him by his father. Finally, there is a refreshing balance in David’s life and character that provides a literary model to emulate, especially for the more artistically-inclined boy often overlooked in literature. David is artistic, yet he knows when to be realistic. He is slight of stature, yet able to handily defend himself when necessary. He is trained and mannerly, yet he is also manly. He is sensitive, yet sensible. Whatever limitations he discovers, he meets them with strength of character.  This is truly one of those books that everyone in your family will like, and will likely want to hear or read more than once. We’re on our fourth reading! It has even inspired us to have Just David days for our children when we focus on the beautiful and lovely things God has given us to enjoy. Just David is just great. Includes family discussion questions at the end of the book.  --Whole Heart Ministries (less)","genre":"Classics, Fiction, Childrens, Historical, Historical Fiction","format":"hardcover","page":240.0,"isbn":9781888692051.0,"au_ge":"hplovecraft classics fiction childrens historical historicalfiction","key_words":"even decided workaday small town good bad boy often encountered emulate especially ’ profound effect david character encounters unlike quiet unassuming children given us wise grows simply importance happiness defies logic father secluded goodness beauty book pollyanna though also put beautiful life affirms story likely want fools suffers harm walked loving suddenly transplanted focus handily defend inspired great includes family discussion questions quality cultivated well within provides felt everyone necessary reprinted since mysterious wins right appetite early violin realistic intentionally lives discovers wonderful novel two years charming little trained artistically inclined overlooked people courage artistic yet world music intentional efforts meets strength stories walks mixture outside creating lovely things god manly preface days reminds say print last year enjoy simplicity like mountains filled past endearing innocence engaging personality biblical principle expressed end truly one moralistic sense stature able fourth reading refreshing balance respect hear touching proverb complexity whose disarming literature rather purely back bestseller provincialism whole heart ministries less imagination resonant chord rarely became orphaned young natural companion formative scope nature unforgettable day knows simple pleasures purposeful study new edition hard eleanor porter wrote runaway success find private slight longer lasting hardcover release typical found finally way goody love struck sensitive sensible whatever limitations books time plays mannerly read transplants literary model several reasons first influences","bow":"hplovecraft classics fiction childrens historical historicalfiction even decided workaday small town good bad boy often encountered emulate especially ’ profound effect david character encounters unlike quiet unassuming children given us wise grows simply importance happiness defies logic father secluded goodness beauty book pollyanna though also put beautiful life affirms story likely want fools suffers harm walked loving suddenly transplanted focus handily defend inspired great includes family discussion questions quality cultivated well within provides felt everyone necessary reprinted since mysterious wins right appetite early violin realistic intentionally lives discovers wonderful novel two years charming little trained artistically inclined overlooked people courage artistic yet world music intentional efforts meets strength stories walks mixture outside creating lovely things god manly preface days reminds say print last year enjoy simplicity like mountains filled past endearing innocence engaging personality biblical principle expressed end truly one moralistic sense stature able fourth reading refreshing balance respect hear touching proverb complexity whose disarming literature rather purely back bestseller provincialism whole heart ministries less imagination resonant chord rarely became orphaned young natural companion formative scope nature unforgettable day knows simple pleasures purposeful study new edition hard eleanor porter wrote runaway success find private slight longer lasting hardcover release typical found finally way goody love struck sensitive sensible whatever limitations books time plays mannerly read transplants literary model several reasons first influences"},{"titles":"Abraham Lincoln","authors":"Eleanor H. Porter","id":13219113,"avg_rating":3.95,"tot_rating":300,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328866643l\/13219113.jpg","description":"As preserver of the Union and emancipator of the slaves, Lincoln occupies a unique niche in the pantheon of American leaders. People from around the world admire his eloquence as a spokesman for democracy and fighter for the oppressed. In this landmark biography, published fifty years after Lincoln's death, an English author recounted for his countrymen the remarkable story of Lincoln's life. Lord Charnwood's comprehensive biography, among the first major books about the sixteenth president, presents a sensitive and literate portrait, tracing Lincoln's rise from humble origins to the highest office in the land and recapturing the profound humanity of his character. From the grinding poverty of his boyhood in the backwoods of Kentucky and Indiana and his early struggles as a prairie lawyer, the author charts Lincoln's elevation to the Illinois legislature, Congress, and the presidency, culminating in his role as commander in chief during the bloodiest struggles in American history. Beautifully written, this unabridged edition also offers profound historical insights into the factors contributing to the Civil War, including economic and political conditions, territorial expansion, foreign and domestic policies, and slavery. This splendid profile of an epic figure whose relevance endures and grows with the passage of time is essential reading for admirers of Lincoln, students and scholars of American history, and anyone who appreciates a well-written, engrossing biography. (less)","genre":"Biography, History, Nonfiction, Politics, Presidents, Military History, Civil War, North American Hi..., American History, Politics, Biography Memoir, American History, American Civil War, War, Military Fiction","format":"paperback","page":512.0,"isbn":9780486299594.0,"au_ge":"eleanorhporter biography history nonfiction politics presidents militaryhistory civilwar northamericanhi... americanhistory politics biographymemoir americanhistory americancivilwar war militaryfiction","key_words":"civil war including economic landmark biography published fifty years preserver american history beautifully written union admirers democracy pantheon political conditions territorial expansion foreign scholars author charts lincolns elevation grinding poverty character presidency culminating appreciates essential reading remarkable story early struggles passage unique niche oppressed literate portrait tracing rise unabridged edition also offers profound historical insights well engrossing less role illinois legislature congress emancipator eloquence land splendid profile grows life lord charnwoods comprehensive among sixteenth president presents death world admire leaders people sensitive anyone countrymen english recounted chief domestic policies first major books around humble origins boyhood backwoods kentucky commander slaves lincoln occupies time factors contributing epic figure whose relevance endures slavery indiana highest office spokesman fighter bloodiest students humanity prairie lawyer recapturing","bow":"eleanorhporter biography history nonfiction politics presidents militaryhistory civilwar northamericanhi... americanhistory politics biographymemoir americanhistory americancivilwar war militaryfiction civil war including economic landmark biography published fifty years preserver american history beautifully written union admirers democracy pantheon political conditions territorial expansion foreign scholars author charts lincolns elevation grinding poverty character presidency culminating appreciates essential reading remarkable story early struggles passage unique niche oppressed literate portrait tracing rise unabridged edition also offers profound historical insights well engrossing less role illinois legislature congress emancipator eloquence land splendid profile grows life lord charnwoods comprehensive among sixteenth president presents death world admire leaders people sensitive anyone countrymen english recounted chief domestic policies first major books around humble origins boyhood backwoods kentucky commander slaves lincoln occupies time factors contributing epic figure whose relevance endures slavery indiana highest office spokesman fighter bloodiest students humanity prairie lawyer recapturing"},{"titles":"A Voice in the Wilderness","authors":"Godfrey Rathbone Benson Charnwood","id":574051,"avg_rating":4.07,"tot_rating":802,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1450803792l\/574051._SY475_.jpg","description":"While on her way to Arizona to teach school, beautiful Margaret Earle suddenly finds herself lost in the wilderness. When a ragged man happens across her in the middle of the night, she believes help has arrived--but he turns out to be even more threatening than the wilderness, and Margaret runs from him in desperation. Lost once more, besieged by the elements, terrified by the howling of wild beasts around her, Margaret wonders how she will survive.  Enter Lance Gardley, a handsome young cowboy who rides out of the darkness to save Margaret's life--and together they discover a new understanding of true friendship . . . and love. (less)","genre":"Romance, Christian Fiction, Christian, Fiction, Romance, Christian Romance","format":"paperback","page":315.0,"isbn":9780842379083.0,"au_ge":"godfreyrathbonebensoncharnwood romance christianfiction christian fiction romance christianromance","key_words":"even new understanding discover believes help together margaret wonders darkness love less threatening arizona turns true friendship runs arrived desperation lost survive enter lance gardley middle besieged elements terrified rides way save margarets life night wilderness handsome young cowboy howling ragged man happens across wild beasts around teach school beautiful earle suddenly finds","bow":"godfreyrathbonebensoncharnwood romance christianfiction christian fiction romance christianromance even new understanding discover believes help together margaret wonders darkness love less threatening arizona turns true friendship runs arrived desperation lost survive enter lance gardley middle besieged elements terrified rides way save margarets life night wilderness handsome young cowboy howling ragged man happens across wild beasts around teach school beautiful earle suddenly finds"},{"titles":"Pilgrimage, Volume 1: Pointed Roofs, Backwater, Honeycomb","authors":"Grace Livingston Hill","id":1129959,"avg_rating":3.73,"tot_rating":142,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1486589184l\/1129959._SY475_.jpg","description":"The thirteen magnificent novels that comprise Pilgrimage are the first expression in English of what it is to be called 'stream of conciousness' technique, predating the work of both Joyce and Woolf, echoing that of Proust with whom Dorothy Richardson stands as one of the great innovatory figures of our time. These four volumes record in detail the life of Miriam Henderson. Through her experience - personal, spiritual, intellectual - Dorothy Richardson explores intensely what it means to be a woman, presenting feminine conciousness with a new voice, a new identity. (less)","genre":"Fiction, Classics","format":"paperback","page":490.0,"isbn":9780860681007.0,"au_ge":"gracelivingstonhill fiction classics","key_words":"experience personal spiritual intellectual dorothy richardson explores intensely woolf echoing joyce detail miriam henderson one four volumes record work stands conciousness technique predating called stream english thirteen magnificent novels life means comprise pilgrimage new voice woman presenting feminine time great innovatory figures proust first expression identity less","bow":"gracelivingstonhill fiction classics experience personal spiritual intellectual dorothy richardson explores intensely woolf echoing joyce detail miriam henderson one four volumes record work stands conciousness technique predating called stream english thirteen magnificent novels life means comprise pilgrimage new voice woman presenting feminine time great innovatory figures proust first expression identity less"},{"titles":"You Know Me Al","authors":"Dorothy M. Richardson","id":971435,"avg_rating":3.83,"tot_rating":717,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347987471l\/971435.jpg","description":"\"You Know me Al\" is a classic of baseball--the game and the community. Jack Keefe, one of literature's greatest characters, is talented, brash, and conceited. Self-assured and imperceptive, impervious to both advice and sarcasm, Keefe rises to the heights, but his inability to learn makes for his undoing. Through a series of letters from this bush-league pitcher to his not-quite-anonymous friend Al, Lardner maintains a balance between the funny and the moving, the pathetic and the glorious. Nostalgic in its view of pre-World War I America--a time before the \"live\" ball, a time filled with names like Ty Cobb, Charles Comiskey, Walter Johnson, and Eddie Cicotte--this is not a simple period piece. It is about competition, about the ability to reason, and most of all it is about being human. First published in 1914, \"You Know Me Al\" says as much to us about ourselves today as it did seventy-five years ago. (less)","genre":"Sports, Baseball, Fiction, Sports, Sports, Humor, Classics, Literature, American","format":"paperback","page":224.0,"isbn":9780020223429.0,"au_ge":"dorothymrichardson sports baseball fiction sports sports humor classics literature american","key_words":"literatures greatest characters eddie cicotte moving ability view us competition simple period piece pathetic inability names like ty cobb charles comiskey walter johnson funny al says time filled quite anonymous friend lardner maintains live ball today series know talented brash glorious nostalgic community jack keefe one america learn makes sarcasm rises baseball undoing heights bush league pitcher reason much seventy five years ago less advice conceited self assured imperceptive impervious letters pre world war human first published game classic balance","bow":"dorothymrichardson sports baseball fiction sports sports humor classics literature american literatures greatest characters eddie cicotte moving ability view us competition simple period piece pathetic inability names like ty cobb charles comiskey walter johnson funny al says time filled quite anonymous friend lardner maintains live ball today series know talented brash glorious nostalgic community jack keefe one america learn makes sarcasm rises baseball undoing heights bush league pitcher reason much seventy five years ago less advice conceited self assured imperceptive impervious letters pre world war human first published game classic balance"},{"titles":"The Two Babylons","authors":"Ring Lardner","id":750676,"avg_rating":3.98,"tot_rating":452,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348523296l\/750676.jpg","description":"Originally a pamphlet published in 1853, The Two Babylons is Hislop's most famous work. In this book he argues that the Roman Catholic Church is nothing more than pagan cult, with roots in Babylonian mystery cults, which have a bank of secret knowledge only available to those who have been formally accepted into the cult. Roman Catholics, Hislop argues, are descendants from early Christians who adopted the Roman religion descended from the worship of Semiramis, the wife of the founder of Babylon. By discrediting the true Christianity of Catholics, Hislop hoped to bolster the legitimacy of the Protestant and Scottish Reformations. Students of theology and those interested in the complex history of Christianity will find Hislop's arguments provocative enough that they may be moved to further research of their own. Scottish minister ALEXANDER HISLOP (1807-1865) became an ordained clergymen in the Free Church of Scotland in 1844. As a Presbyterian minister, Hislop was famously critical of (less)","genre":"History, Nonfiction, Religion, Religion, Christianity, Christian, Spirituality","format":"paperback","page":330.0,"isbn":9781881316367.0,"au_ge":"ringlardner history nonfiction religion religion christianity christian spirituality","key_words":"pamphlet published secret knowledge less bank protestant wife legitimacy may catholics hislop hoped babylonian mystery cults famously critical semiramis interested bolster babylon originally scottish minister alexander became hislops christianity true two babylons roots book famous work ordained clergymen pagan cult founder discrediting nothing research early christians moved roman argues presbyterian find arguments provocative enough religion descended catholic church reformations students available adopted free scotland theology formally accepted descendants complex history worship","bow":"ringlardner history nonfiction religion religion christianity christian spirituality pamphlet published secret knowledge less bank protestant wife legitimacy may catholics hislop hoped babylonian mystery cults famously critical semiramis interested bolster babylon originally scottish minister alexander became hislops christianity true two babylons roots book famous work ordained clergymen pagan cult founder discrediting nothing research early christians moved roman argues presbyterian find arguments provocative enough religion descended catholic church reformations students available adopted free scotland theology formally accepted descendants complex history worship"},{"titles":"Xingu","authors":"Alexander Hislop","id":1862884,"avg_rating":3.99,"tot_rating":659,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348302037l\/1862884.jpg","description":null,"genre":"Short Stories, Classics, Fiction, Humor","format":"paperback","page":48.0,"isbn":9781419195136.0,"au_ge":"alexanderhislop shortstories classics fiction humor","key_words":"","bow":"alexanderhislop shortstories classics fiction humor "},{"titles":"પાટણની પ્રભુતા","authors":"Edith Wharton","id":24484477,"avg_rating":4.33,"tot_rating":207,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1421179804l\/24484477.jpg","description":"The kingdom of Patan faces an ominous future. King Karnadev lies on his deathbed. His son, Jaydev, is too young to ascend the throne. Rumours abound of scheming warlords intent on establishing their own independence and powerful merchants plotting to wrest control from Patan Fort. There is also the shadowy monk Anandsuri and his vision to unite Patan under one religion: Jainism. In the eye of this gathering storm are Queen Minaldevi and the shrewd chief minister Munjal Mehta. Both have striven to maintain order in Patan and ensure that Jaydev's succession is secure. But the attraction between them is threatened by betrayal and intrigue, with dramatic consequences for the future of Patan. A sprawling, fast-paced saga in the oeuvre of Alexandre Dumas, The Glory of Patan is the first book in an epic trilogy about the exploits of the magnificent Chalukya dynasty at a crucial period in the history of Gujarat. (less)","genre":"Historical, Historical Fiction","format":"hardcover","page":248.0,"isbn":9788184612318.0,"au_ge":"edithwharton historical historicalfiction","key_words":"magnificent chalukya dynasty patan wrest control faces jaydevs succession queen minaldevi maintain order independence glory threatened one religion jainism establishing also first book unite shadowy monk anandsuri scheming warlords intent eye betrayal son jaydev deathbed ascend future alexandre dumas history shrewd chief minister munjal mehta kingdom gathering storm sprawling fast paced saga young ensure exploits throne rumours abound crucial period gujarat less epic trilogy attraction fort intrigue dramatic consequences oeuvre striven ominous king karnadev lies secure vision powerful merchants plotting","bow":"edithwharton historical historicalfiction magnificent chalukya dynasty patan wrest control faces jaydevs succession queen minaldevi maintain order independence glory threatened one religion jainism establishing also first book unite shadowy monk anandsuri scheming warlords intent eye betrayal son jaydev deathbed ascend future alexandre dumas history shrewd chief minister munjal mehta kingdom gathering storm sprawling fast paced saga young ensure exploits throne rumours abound crucial period gujarat less epic trilogy attraction fort intrigue dramatic consequences oeuvre striven ominous king karnadev lies secure vision powerful merchants plotting"},{"titles":"The Clue of the Twisted Candle","authors":"K.M. Munshi","id":854300,"avg_rating":3.51,"tot_rating":569,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348623007l\/854300.jpg","description":"'The Urbane T.X. is back in this locked-room mystery by British master storyteller Edgar Wallace. The renown mystery writer John Lexman is charged with murder and sent to prison. His friend T.X. Meredith, employed by Scotland Yard, tries to prove his innocence.","genre":"Mystery, Fiction, Mystery, Crime, Classics, European Literature, British Literature","format":"paperback","page":192.0,"isbn":9781419157028.0,"au_ge":"kmmunshi mystery fiction mystery crime classics europeanliterature britishliterature","key_words":"sent scotland yard tries urbane friend prison x back renown mystery writer john lexman prove innocence meredith employed locked room british master storyteller edgar wallace murder charged","bow":"kmmunshi mystery fiction mystery crime classics europeanliterature britishliterature sent scotland yard tries urbane friend prison x back renown mystery writer john lexman prove innocence meredith employed locked room british master storyteller edgar wallace murder charged"},{"titles":"Green Face","authors":"Edgar Wallace","id":575836,"avg_rating":3.92,"tot_rating":471,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348606528l\/575836.jpg","description":"A stranger enters a magician's shop. Inside, among several strange customers, he sees an old man, who makes him sick with horror. The rest of the novel chronicles his quest for the elusive and horrible old man.","genre":"Fiction, Fantasy, Horror, Classics","format":"paperback","page":100.0,"isbn":9780946626922.0,"au_ge":"edgarwallace fiction fantasy horror classics","key_words":"sick stranger enters old man magicians shop inside among several strange customers makes horror quest novel chronicles elusive horrible sees rest","bow":"edgarwallace fiction fantasy horror classics sick stranger enters old man magicians shop inside among several strange customers makes horror quest novel chronicles elusive horrible sees rest"},{"titles":"The Border Legion","authors":"Gustav Meyrink","id":121179,"avg_rating":3.72,"tot_rating":603,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1566286476l\/121179.jpg","description":"This book was converted from its physical edition to the digital format by a community of volunteers. You may find it for free on the web. Purchase of the Kindle edition includes wireless delivery.","genre":"Westerns, Fiction, Classics, Adventure","format":"mass market paperback","page":null,"isbn":9781406927207.0,"au_ge":"gustavmeyrink westerns fiction classics adventure","key_words":"free converted digital format web purchase volunteers may find kindle edition includes wireless delivery community physical book","bow":"gustavmeyrink westerns fiction classics adventure free converted digital format web purchase volunteers may find kindle edition includes wireless delivery community physical book"},{"titles":"Занимательная физика. Книга 2","authors":"Zane Grey","id":35107563,"avg_rating":4.45,"tot_rating":295,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1494397672l\/35107563._SY475_.jpg","description":"Парадоксы, головоломки, задачи, опыты, замысловатые вопросы и разсказы изъ области физики.  Книга вторая","genre":"Science, Science, Physics, Nonfiction","format":"paperback","page":225.0,"isbn":null,"au_ge":"zanegrey science science physics nonfiction","key_words":"парадоксы головоломки задачи опыты замысловатые вопросы и разсказы изъ области физики книга вторая","bow":"zanegrey science science physics nonfiction парадоксы головоломки задачи опыты замысловатые вопросы и разсказы изъ области физики книга вторая"},{"titles":"Twilight in Italy","authors":"Yakov Perelman","id":10150626,"avg_rating":3.61,"tot_rating":301,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348311188l\/10150626.jpg","description":"This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide. (less)","genre":"Travel, Cultural, Italy, Classics, Nonfiction","format":"hardcover","page":322.0,"isbn":9781117935195.0,"au_ge":"yakovperelman travel cultural italy classics nonfiction","key_words":"elected digitization process though reading experience pre historical reproduction believe printed works worldwide less attempt books may made best efforts quality assurance imperfections introduced work book back occasional errors part print curated remove conducted impede preservation continuing commitment culturally important bring","bow":"yakovperelman travel cultural italy classics nonfiction elected digitization process though reading experience pre historical reproduction believe printed works worldwide less attempt books may made best efforts quality assurance imperfections introduced work book back occasional errors part print curated remove conducted impede preservation continuing commitment culturally important bring"},{"titles":"Pallieter","authors":"D.H. Lawrence","id":2528687,"avg_rating":3.33,"tot_rating":313,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1327567931l\/2528687.jpg","description":"Der lebensfrohe und naturverbundene Pallieter, über dessen Alter und bisheriges Leben der Leser nichts Genaueres erfährt, lebt auf einem kleinen Hof im Tal des Flüsschens Nethe zusammen mit seiner frommen Schwester Charlot, die ihm den Haushalt führt, sowie dem Pferd Beiaard, dem Hund Lubas und einigen anderen Tieren. Zu Pfingsten lernt Pallieter bei einem fröhlichen ...more","genre":"Fiction","format":"paperback","page":230.0,"isbn":9783458331308.0,"au_ge":"dhlawrence fiction","key_words":"der lebensfrohe und naturverbundene pallieter über dessen alter bisheriges leben leser nichts genaueres erfährt lebt auf einem kleinen hof im tal des flüsschens nethe zusammen mit seiner frommen schwester charlot die ihm den haushalt führt sowie dem pferd beiaard hund lubas einigen anderen tieren zu pfingsten lernt bei fröhlichen","bow":"dhlawrence fiction der lebensfrohe und naturverbundene pallieter über dessen alter bisheriges leben leser nichts genaueres erfährt lebt auf einem kleinen hof im tal des flüsschens nethe zusammen mit seiner frommen schwester charlot die ihm den haushalt führt sowie dem pferd beiaard hund lubas einigen anderen tieren zu pfingsten lernt bei fröhlichen"},{"titles":"Легкое Дыхание","authors":"Felix Timmermans","id":12655881,"avg_rating":4.05,"tot_rating":573,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1466629428l\/12655881.jpg","description":"«Летний вечер, ямщицкая тройка, бесконечный пустынный большак…» Бунинскую музыку прозаического письма не спутаешь ни с какой другой, в ней живут краски, звуки, запахи… Бунин не пиcал романов. Но чисто русский и получивший всемирное признание жанр рассказа или небольшой повести он довел до совершенства.В эту книгу вошли наиболее известные повести и рассказы писателя: « ...more","genre":"Cultural, Russia, Classics, Fiction, Short Stories, Literature, Russian Literature","format":null,"page":208.0,"isbn":9785080001277.0,"au_ge":"felixtimmermans cultural russia classics fiction shortstories literature russianliterature","key_words":"« летний вечер ямщицкая тройка бесконечный пустынный большак …» бунинскую музыку прозаического письма не спутаешь ни с какой другой в ней живут краски звуки запахи … бунин пиcал романов но чисто русский и получивший всемирное признание жанр рассказа или небольшой повести он довел до совершенства эту книгу вошли наиболее известные рассказы писателя","bow":"felixtimmermans cultural russia classics fiction shortstories literature russianliterature « летний вечер ямщицкая тройка бесконечный пустынный большак …» бунинскую музыку прозаического письма не спутаешь ни с какой другой в ней живут краски звуки запахи … бунин пиcал романов но чисто русский и получивший всемирное признание жанр рассказа или небольшой повести он довел до совершенства эту книгу вошли наиболее известные рассказы писателя"},{"titles":"You Come Too","authors":"Ivan Bunin","id":12144,"avg_rating":4.15,"tot_rating":497,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1420165824l\/12144.jpg","description":"For use in schools and libraries only. A collection of poems chosen by Frost to be read and enjoyed by children (and their elders), including \"Acquainted With The Night,\" \"A Patch Of Old Snow,\" \"Not Of School Age, \"and \"Mending Wall.","genre":"Poetry, Classics, Nonfiction","format":"hardcover","page":94.0,"isbn":9780370010670.0,"au_ge":"ivanbunin poetry classics nonfiction","key_words":"patch children libraries use read mending wall night poems chosen enjoyed school age elders including acquainted schools frost collection old snow","bow":"ivanbunin poetry classics nonfiction patch children libraries use read mending wall night poems chosen enjoyed school age elders including acquainted schools frost collection old snow"},{"titles":"The Return of Dr. Fu-Manchu","authors":"Robert Frost","id":13129813,"avg_rating":3.6,"tot_rating":502,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1333579745l\/13129813.jpg","description":"London, 1913—the era of Sherlock Holmes, Dracula, and the Invisible Man. A time of shadows, secret societies, and dens filled with opium addicts. Into this world comes the most fantastic emissary of evil society has ever known... Dr. Fu-Manchu.  The insidious doctor returns to Great Britain with his league of assassins, the dreaded Si-Fan. He seeks to subvert the realm at the highest levels, but Fu-Manchu has his own secrets—which he will protect by any means. (less)","genre":"Mystery, Fiction, Pulp, Mystery, Crime, Classics, Novels, Thriller, Adventure, Thriller, Mystery Thriller, Historical","format":"paperback","page":278.0,"isbn":9780857686046.0,"au_ge":"robertfrost mystery fiction pulp mystery crime classics novels thriller adventure thriller mysterythriller historical","key_words":"sherlock holmes dracula london — secrets dens filled league world comes dreaded si fan invisible man highest levels evil society seeks realm fantastic emissary protect great britain shadows secret societies means less insidious doctor returns time ever known dr fu manchu opium addicts assassins subvert era","bow":"robertfrost mystery fiction pulp mystery crime classics novels thriller adventure thriller mysterythriller historical sherlock holmes dracula london — secrets dens filled league world comes dreaded si fan invisible man highest levels evil society seeks realm fantastic emissary protect great britain shadows secret societies means less insidious doctor returns time ever known dr fu manchu opium addicts assassins subvert era"},{"titles":"Palli Samaj: The Homecoming","authors":"Sax Rohmer","id":332024,"avg_rating":3.97,"tot_rating":450,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1370839426l\/332024.jpg","description":"The novel deals with the efforts of Ramesh, a young Roorkee-trained engineer, to bring some change in the caste-ridden village and to elevate the villagers to a better level of existence. It deals in depth with the corruption that infects the village, and Ramesh's efforts to remove it.","genre":"Fiction, Classics, Romance","format":"paperback","page":188.0,"isbn":9788171675609.0,"au_ge":"saxrohmer fiction classics romance","key_words":"corruption young roorkee trained engineer rameshs efforts elevate better level remove village ramesh novel deals change depth infects existence villagers caste ridden bring","bow":"saxrohmer fiction classics romance corruption young roorkee trained engineer rameshs efforts elevate better level remove village ramesh novel deals change depth infects existence villagers caste ridden bring"},{"titles":"Light and Darkness","authors":"Sarat Chandra Chattopadhyay","id":62775,"avg_rating":3.77,"tot_rating":231,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1469301246l\/62775.jpg","description":"Published in 1917, \"Light and Dark\" is unlike any of Natsume Soseki's previous works and unique in Japanese fiction of the period. What distinguishes the novel as \"modern\" is its remarkable representation of interiority. The protagonists, Tsuda Yoshio, thirty, and his wife O-Nobu, twenty-three, exhibit a gratifying complexity that qualifies them as some of the earliest ...more","genre":"Cultural, Japan, Asian Literature, Japanese Literature, Fiction, Classics","format":"paperback","page":397.0,"isbn":9780399506109.0,"au_ge":"saratchandrachattopadhyay cultural japan asianliterature japaneseliterature fiction classics","key_words":"interiority wife light gratifying complexity unlike earliest remarkable representation dark published nobu twenty three exhibit unique natsume sosekis previous works protagonists tsuda yoshio thirty qualifies distinguishes modern novel japanese fiction period","bow":"saratchandrachattopadhyay cultural japan asianliterature japaneseliterature fiction classics interiority wife light gratifying complexity unlike earliest remarkable representation dark published nobu twenty three exhibit unique natsume sosekis previous works protagonists tsuda yoshio thirty qualifies distinguishes modern novel japanese fiction period"},{"titles":"Clairvoyance and Occult Powers","authors":"Natsume Sōseki","id":18884827,"avg_rating":3.43,"tot_rating":239,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1385123918l\/18884827.jpg","description":"There is in every human being a sense which is not generally recognized as such, although nearly every person has had more or less experience regarding its workings. I refer to the sense of the presence of other living things, separate and apart from the operation of any of the five ordinary physical senses. I ask you to understand that I am not claiming that this is a higher sense than the other physical senses, or that it has come to man in a high state of evolution... (less)","genre":"Spirituality, Nonfiction, Reference, Witchcraft","format":null,"page":373.0,"isbn":9781775414100.0,"au_ge":"natsumesōseki spirituality nonfiction reference witchcraft","key_words":"ask understand living things separate evolution less come higher sense presence workings refer five ordinary physical senses apart although nearly every person high state claiming man generally recognized operation experience regarding human","bow":"natsumesōseki spirituality nonfiction reference witchcraft ask understand living things separate evolution less come higher sense presence workings refer five ordinary physical senses apart although nearly every person high state claiming man generally recognized operation experience regarding human"},{"titles":"The Adventures of Buster Bear","authors":"William Walker Atkinson","id":716361,"avg_rating":4.11,"tot_rating":436,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328868375l\/716361.jpg","description":"When Buster Bear comes to live in the Green Forest, the amiable bully stirs up quite a commotion, for bears haven't lived in the forest for years. And sure enough, before long Buster has a series of run-ins with Little Joe Otter, Chatterer the Red Squirrel, Farmer Brown's Boy, and even a stubborn metal pail! These and other entertaining escapades are delightfully recounted in this engaging tale. Set in a timeless world of bubbling brooks, blue skies, and green groves, the story also teaches valuable lessons on the dangers of greed, pride, and insensitivity. The text, printed in large, easy-to-read type, is enhanced by six charming illustrations, based on the originals by Harrison Cady. (less)","genre":"Childrens, Animals, Classics, Fiction, Fantasy, Animals, Animal Fiction, Childrens, Academic, School, Adventure, Young Adult","format":"paperback","page":96.0,"isbn":9780486275642.0,"au_ge":"williamwalkeratkinson childrens animals classics fiction fantasy animals animalfiction childrens academic school adventure youngadult","key_words":"even buster bear comes red squirrel farmer browns boy little joe otter chatterer commotion entertaining escapades engaging tale set bubbling brooks blue skies bears havent lived forest green years groves harrison cady less live run ins greed pride series large easy quite text printed timeless world read type sure enough insensitivity enhanced delightfully recounted story also teaches valuable lessons originals dangers six charming illustrations based long stubborn metal pail amiable bully stirs","bow":"williamwalkeratkinson childrens animals classics fiction fantasy animals animalfiction childrens academic school adventure youngadult even buster bear comes red squirrel farmer browns boy little joe otter chatterer commotion entertaining escapades engaging tale set bubbling brooks blue skies bears havent lived forest green years groves harrison cady less live run ins greed pride series large easy quite text printed timeless world read type sure enough insensitivity enhanced delightfully recounted story also teaches valuable lessons originals dangers six charming illustrations based long stubborn metal pail amiable bully stirs"},{"titles":"With Her in Ourland","authors":"Thornton W. Burgess","id":304432,"avg_rating":3.37,"tot_rating":196,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348465846l\/304432.jpg","description":"Two works in one, this volume contains the full text of With Her in Ourland by Charlotte Perkins Gilman, as well as an illuminating sociological analysis by Mary Jo Deegan with the assistance of Michael R. Hill. Ourland is the sequel to Gilman's acclaimed feminist utopian novel Herland; both were published in her journal, The Forerunner, in 1915 and 1916. Ourland resumes the adventures of Herland's protagonists, Ellador and Van, but turns from utopian fantasy to a challenging analysis of contemporary social fissures in \"his land,\" or the real world. The republication of Herland as a separate novel in 1979 revived critical interest in Gilman's work but truncated the larger aims implicit in the Herland\/Ourland saga, leaving an erroneous understanding of Gilman's other\/better half of the story, in which it is suggested that strong women can resocialize men to be nurturant and cooperative. Gilman's choice of a sexually integrated society in With Her in Ourland provides us with her answer to her ideal society, but her foray into a woman-only society as a corrective to a male dominated one is a controversial option. The challenging message of Ourland, however, does not impede the pleasure of reading it as a novel.  Though known more for her fiction today, Gilman in her time was a recognized and accomplished sociologist who admired Lester F. Ward and frequently visited Jane Addams of Chicago's Hull-House. The male protagonist in Herland\/Ourland, Van, is a sociologist, used by Gilman as a foil on which to skewer the assumptions and practices of patriarchal sociology. The interpretation presented here, which adopts a sociological viewpoint, is invaluable reading for scholars and students of sociology, American women's studies, and utopian literature. (less)","genre":"Fiction, Feminism, Science Fiction, Fantasy, Gender, Classics, Gender, Gender Studies, Science Fiction Fantasy, Literature, Adult","format":"hardcover","page":216.0,"isbn":9780313276149.0,"au_ge":"thorntonwburgess fiction feminism sciencefiction fantasy gender classics gender genderstudies sciencefictionfantasy literature adult","key_words":"herland sequel sociologist used reading ourland saga leaving sociological viewpoint woman land larger aims implicit gilmans work truncated acclaimed feminist utopian novel separate van recognized fantasy impede pleasure story answer frequently visited jane addams chicagos hull house foil volume contains foray journal illuminating analysis nurturant sociology american womens studies society corrective accomplished real world skewer invaluable gilman provides us fiction today ideal practices forerunner challenging erroneous understanding mary jo deegan male protagonist published one republication suggested dominated revived critical interest well full text strong women literature less sexually integrated herlands protagonists ellador resumes michael r hill though known however cooperative choice students two works scholars adventures assistance charlotte perkins turns controversial option message admired lester f ward resocialize men time interpretation presented assumptions contemporary social fissures better half patriarchal adopts","bow":"thorntonwburgess fiction feminism sciencefiction fantasy gender classics gender genderstudies sciencefictionfantasy literature adult herland sequel sociologist used reading ourland saga leaving sociological viewpoint woman land larger aims implicit gilmans work truncated acclaimed feminist utopian novel separate van recognized fantasy impede pleasure story answer frequently visited jane addams chicagos hull house foil volume contains foray journal illuminating analysis nurturant sociology american womens studies society corrective accomplished real world skewer invaluable gilman provides us fiction today ideal practices forerunner challenging erroneous understanding mary jo deegan male protagonist published one republication suggested dominated revived critical interest well full text strong women literature less sexually integrated herlands protagonists ellador resumes michael r hill though known however cooperative choice students two works scholars adventures assistance charlotte perkins turns controversial option message admired lester f ward resocialize men time interpretation presented assumptions contemporary social fissures better half patriarchal adopts"},{"titles":"The Power House (Sir Edward Leithen, #1)","authors":"Charlotte Perkins Gilman","id":4772688,"avg_rating":3.43,"tot_rating":362,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1315021113l\/4772688.jpg","description":"When his friend Charles Pitt-Heron vanishes mysteriously, Sir Edward Leithen is at first only mildly concerned. But a series of strange events that follow Pitt-Heron’s disappearance convinces Leithen that he is dealing with a sinister secret society. Their codename is ‘The Power-House’. The authorities are unable to act without evidence. As he gets deeper involved with the ...more","genre":"Mystery, Fiction, Classics, Adventure, Thriller, Novels, Thriller, Mystery Thriller, Suspense, Cultural, Scotland, European Literature, British Literature","format":"paperback","page":112.0,"isbn":9781842327845.0,"au_ge":"charlotteperkinsgilman mystery fiction classics adventure thriller novels thriller mysterythriller suspense cultural scotland europeanliterature britishliterature","key_words":"unable series friend charles pitt heron vanishes mysteriously sir edward leithen ‘ disappearance convinces dealing strange events first mildly concerned sinister secret society authorities gets deeper involved power house ’ follow codename act without evidence","bow":"charlotteperkinsgilman mystery fiction classics adventure thriller novels thriller mysterythriller suspense cultural scotland europeanliterature britishliterature unable series friend charles pitt heron vanishes mysteriously sir edward leithen ‘ disappearance convinces dealing strange events first mildly concerned sinister secret society authorities gets deeper involved power house ’ follow codename act without evidence"},{"titles":"Penrod and Sam","authors":"John Buchan","id":274716,"avg_rating":4.07,"tot_rating":432,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348420171l\/274716.jpg","description":"1916. Tarkington was one of the most popular American novelist and dramatist of his time. The Penrod series of novels deal with the daily life and trials of a boy of eleven and twelve in turn of the century Indiana. The humor is found in the petty hypocrisies of the adults and the naoveti of the children and how those two things intertwine. Penrod is not alone in his travels in this volume he is accompanied by his loyal yet aging dog Duke, his best friend Sam Williams, and two African Americans across the alley, Herman and Verman. Contents: Penrod and Sam; The Bonded Prisoner; The Militarist; Bingism; The In-Or-In; Georgie Becomes a Member; Whitey; Salvage; Reward of Merit; Conscience; The Tonic; Gipsy; Concerning Trousers; Camera Work in the Jungle; A Model Letter to a Friend; Wednesday Madness; Penrod's Busy Day; On Account of the Weather; Creative Art; The Departing Guest; Yearnings; The Horn of Fame; The Party; and The Heart of Marjorie Jones. See other titles by this author available from Kessinger Publishing. (less)","genre":"Fiction, Classics, Childrens, Humor, Academic, School, Classics, Classic Literature, Young Adult","format":"paperback","page":148.0,"isbn":9781847025883.0,"au_ge":"johnbuchan fiction classics childrens humor academic school classics classicliterature youngadult","key_words":"turn humor tonic gipsy concerning trousers camera work model letter volume eleven best friend sam williams heart georgie becomes marjorie jones see century indiana militarist bingism one account travels novels deal two african americans across tarkington merit conscience verman contents penrod found twelve departing guest yearnings daily life kessinger publishing less loyal yet aging dog duke dramatist children things intertwine series petty hypocrisies weather creative art trials wednesday madness penrods busy day horn alley herman fame time boy adults accompanied jungle naoveti member whitey salvage reward alone bonded prisoner author available party popular american novelist titles","bow":"johnbuchan fiction classics childrens humor academic school classics classicliterature youngadult turn humor tonic gipsy concerning trousers camera work model letter volume eleven best friend sam williams heart georgie becomes marjorie jones see century indiana militarist bingism one account travels novels deal two african americans across tarkington merit conscience verman contents penrod found twelve departing guest yearnings daily life kessinger publishing less loyal yet aging dog duke dramatist children things intertwine series petty hypocrisies weather creative art trials wednesday madness penrods busy day horn alley herman fame time boy adults accompanied jungle naoveti member whitey salvage reward alone bonded prisoner author available party popular american novelist titles"},{"titles":"The Adventures of Old Mr. Toad","authors":"Booth Tarkington","id":752907,"avg_rating":4.05,"tot_rating":397,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328866942l\/752907.jpg","description":"Old Mr. Toad was acting strangely, and his behavior puzzled all the creatures of the Green Meadow. You see, he was in a hurry, and Old Mr. Toad NEVER hurried unless he was in danger. Where on earth could he be off to? To find out, Jimmy Skunk, Peter Cottontail, Unc' Billy Possum, and some other animals of the Green Forest secretly follow the old gentleman through the ...more","genre":"Classics, Childrens, Animals, Fiction, Fantasy","format":"paperback","page":80.0,"isbn":9780486403854.0,"au_ge":"boothtarkington classics childrens animals fiction fantasy","key_words":"green meadow old mr toad never hurried unless jimmy skunk peter cottontail unc billy possum earth could behavior puzzled acting strangely hurry danger find animals gentleman forest secretly follow see creatures","bow":"boothtarkington classics childrens animals fiction fantasy green meadow old mr toad never hurried unless jimmy skunk peter cottontail unc billy possum earth could behavior puzzled acting strangely hurry danger find animals gentleman forest secretly follow see creatures"},{"titles":"The Ivory Child","authors":"Thornton W. Burgess","id":696070,"avg_rating":3.84,"tot_rating":318,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348754355l\/696070.jpg","description":"While Quartermain visits Lord Randall, two foreigners come asking for Macumazana -- that is, asking for Allan Quartermain by the name he used among the Africans. The two visitors are Harut and Marut, priests and doctors of the White Kendah People and they have come to ask Allan Quartermain for his help. The White Kendah people are at war with the Black Kendah people who      ...more","genre":"Adventure, Fiction, Classics, Fantasy, Cultural, Africa","format":"paperback","page":312.0,"isbn":9781600967856.0,"au_ge":"thorntonwburgess adventure fiction classics fantasy cultural africa","key_words":"two visitors help harut macumazana asking africans quartermain visits lord randall foreigners come ask allan name used among marut priests war doctors white kendah people black","bow":"thorntonwburgess adventure fiction classics fantasy cultural africa two visitors help harut macumazana asking africans quartermain visits lord randall foreigners come ask allan name used among marut priests war doctors white kendah people black"},{"titles":"Thinking as a Science","authors":"H. Rider Haggard","id":464215,"avg_rating":4.08,"tot_rating":200,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348383767l\/464215.jpg","description":"This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work. (less)","genre":"Philosophy, Economics, Nonfiction, Psychology, Science, Audiobook, Philosophy, Logic","format":"paperback","page":256.0,"isbn":9781417925674.0,"au_ge":"hriderhaggard philosophy economics nonfiction psychology science audiobook philosophy logic","key_words":"marks notations marginalia believe worlds literature commitment flawed pages age work true may contain imperfections original due part less facsimile reprint scarce antiquarian book protecting preserving made available affordable high quality modern editions promoting culturally important","bow":"hriderhaggard philosophy economics nonfiction psychology science audiobook philosophy logic marks notations marginalia believe worlds literature commitment flawed pages age work true may contain imperfections original due part less facsimile reprint scarce antiquarian book protecting preserving made available affordable high quality modern editions promoting culturally important"},{"titles":"The Collected Poems","authors":"Henry Hazlitt","id":1120231,"avg_rating":4.01,"tot_rating":321,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1347477809l\/1120231.jpg","description":"This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally ...more","genre":"Poetry, Classics, Literature, Nonfiction, War, Biography","format":"paperback","page":192.0,"isbn":9781426411113.0,"au_ge":"henryhazlitt poetry classics literature nonfiction war biography","key_words":"remove books imperfections introduced work culturally digitization process though conducted occasional errors reading experience pre historical reproduction believe attempt may made best efforts quality assurance impede curated","bow":"henryhazlitt poetry classics literature nonfiction war biography remove books imperfections introduced work culturally digitization process though conducted occasional errors reading experience pre historical reproduction believe attempt may made best efforts quality assurance impede curated"},{"titles":"The King of Ireland's Son","authors":"Rupert Brooke","id":1052599,"avg_rating":4.17,"tot_rating":260,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1328866554l\/1052599.jpg","description":"Compiled by noted Irish author Padraic Colum, this treasury of time-honored tales from the fairy-haunted folklore of the Emerald Isle includes these favorite stories: \"Fedelma, the Enchanter's Daughter,\" \"When the King of the Cats Came to King Connal's Dominion,\" \"The Sword of Light and the Unique Tale,\" \"The Town of the Red Castle,\" \"The King of the Land of Mist,\" \"The House of Crom Duv,\" and \"The Spae-Woman.\" Brimming with sly humor, whimsy and imagination, these delightful tales offer hours of enjoyable reading. Nine full-page illustrations and numerous other decorations by Willy Pogány further enhance the text with a mood of timeless enchantment. (less)","genre":"Cultural, Ireland, Fantasy, Fiction, Childrens, Classics, Fantasy, Mythology","format":"paperback","page":320.0,"isbn":9780486297224.0,"au_ge":"rupertbrooke cultural ireland fantasy fiction childrens classics fantasy mythology","key_words":"sly humor whimsy king connals dominion time honored tales unique tale favorite stories fedelma light text emerald isle includes mist spae woman brimming numerous red castle enhance land noted irish author padraic colum sword enchanters daughter enjoyable reading nine full page illustrations cats came delightful offer hours decorations mood timeless enchantment less willy pogány crom duv fairy haunted folklore town imagination compiled treasury house","bow":"rupertbrooke cultural ireland fantasy fiction childrens classics fantasy mythology sly humor whimsy king connals dominion time honored tales unique tale favorite stories fedelma light text emerald isle includes mist spae woman brimming numerous red castle enhance land noted irish author padraic colum sword enchanters daughter enjoyable reading nine full page illustrations cats came delightful offer hours decorations mood timeless enchantment less willy pogány crom duv fairy haunted folklore town imagination compiled treasury house"},{"titles":"Old Peter's Russian Tales","authors":"Padraic Colum","id":989812,"avg_rating":4.0,"tot_rating":250,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1180034345l\/989812._SY475_.jpg","description":"This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into ...more","genre":"Short Stories, Childrens, Fantasy, Fairy Tales, Cultural, Russia, Fiction, Literature, Russian Literature, Fantasy, Classics","format":"paperback","page":null,"isbn":9781903252161.0,"au_ge":"padraiccolum shortstories childrens fantasy fairytales cultural russia fiction literature russianliterature fantasy classics","key_words":"missing elected original artifact work occasional imperfections book may reproduction either part despite believe back introduced published culturally important scanning process blurred pages poor pictures errant marks etc bring","bow":"padraiccolum shortstories childrens fantasy fairytales cultural russia fiction literature russianliterature fantasy classics missing elected original artifact work occasional imperfections book may reproduction either part despite believe back introduced published culturally important scanning process blurred pages poor pictures errant marks etc bring"},{"titles":"Mr. Britling Sees it Through","authors":"Arthur Ransome","id":787234,"avg_rating":3.67,"tot_rating":160,"year_pub":"1916","img":"https:\/\/i.gr-assets.com\/images\/S\/compressed.photo.goodreads.com\/books\/1348269072l\/787234.jpg","description":"H.G. Wells' attempt to make sense of World War I. It begins with a lighthearted account of an American visiting England for the first time, but the outbreak of war changes everything. Day by day and month by month, Wells chronicles the unfolding events and public reaction as witnessed by the inhabitants of one house in rural Essex. Each of the characters tries in a different way to keep their bearings in a world suddenly changed beyond recognition. This book was published in 1916 while the war was still in progress, so no clear resolution was possible. Wells did not know how long the war would last or which side would ultimately win, but he hoped that somehow, something good might eventually come of it. (less)","genre":"Fiction, Classics, War, Literature","format":"paperback","page":384.0,"isbn":9781426474927.0,"au_ge":"arthurransome fiction classics war literature","key_words":"unfolding events less day first time war somehow something good might eventually come long changes everything published rural essex outbreak public reaction h g wells attempt characters tries begins still side would ultimately win book month chronicles last one house make sense progress keep world possible know inhabitants hoped clear resolution bearings american visiting england different way witnessed lighthearted account suddenly changed beyond recognition","bow":"arthurransome fiction classics war literature unfolding events less day first time war somehow something good might eventually come long changes everything published rural essex outbreak public reaction h g wells attempt characters tries begins still side would ultimately win book month chronicles last one house make sense progress keep world possible know inhabitants hoped clear resolution bearings american visiting england different way witnessed lighthearted account suddenly changed beyond recognition"}]